[
    {
        "week_starting": "2019-12-30",
        "week_ending": "2020-01-05",
        "summary": "### Weekly Recap: December 30, 2019 – January 5, 2020\n\n---\n\n#### **Summary Section:**\n\n**Key Highlights:**\n- New Year's Eve celebrations at various locations.\n- Juulio's potential new year's kiss with his buddy's sister sparks debate.\n- Bront shares exciting news about moving into a new, larger apartment.\n- Discussions about the Mandalorian finale and its tie-ins with Clone Wars.\n- A mix of humorous banter about TV mounting struggles and cooking disasters.\n\n**Main Topics of Discussion:**\n- **New Year’s Plans:** Group shared their individual plans for ringing in the New Year, including Juulio's casino trip and Hubert's wild rooftop antics.\n- **Personal Updates:** Bront's apartment move and settling into new living arrangements were major highlights.\n- **Pop Culture:** The group discussed the Mandalorian finale, addressing the show’s impact and the transition to Clone Wars.\n- **TV Mounting:** Jake's struggles with wall-mounting his TV became a running joke throughout the week.\n\n**Emotional States:**\n- The mood was predominantly humorous and celebratory during New Year's, with moments of nostalgia and reflection about the past year. However, some expressed anxiety and the \"Sunday Scaries\" that followed the festivities.\n\n**Controversies:**\n- Lighthearted debates arose regarding what constitutes a proper New Year’s kiss and the appropriateness of shooting guns off rooftops.\n\n**Personal Updates and Life Events:**\n- Bront officially moved into a new apartment, marking a significant life milestone.\n- Juulio had a memorable New Year’s Eve experience involving potential romantic complications.\n- Conversations about work stress and holiday recovery as members returned to their routines post-New Year.\n\n**Best Line of the Week:**\n- \"Sometimes you just have to risk it for the biscuit.\" – Hubert Cumberdale, in reference to Juulio's New Year's kiss dilemma.\n\n---\n\n#### **Narrative Section:**\n\nWhat a week it’s been, friends! Kicking off with the last days of 2019, the group was buzzing with excitement for New Year's Eve. Juulio was all set for a night at the casino, throwing around bets like a high roller, while Hubert contemplated a rather unconventional way to celebrate—by shooting guns off the roof. \"That’s crazy enough it might just work,\" Bront chimed in, cementing their inside joke about dealing with the FBI.\n\nAs the clock ticked down toward midnight, the group exchanged predictions about their New Year’s kisses. Juulio's love life took center stage when he confessed he might be kissing his buddy's sister. \"Like yeah, she's insanely hot, but my buddy's gonna be pissed lol,\" he remarked. Jack poked fun, reminding him, “Didn’t she already kiss you? The damage is done.” Classic Juulio—always finding himself in these sticky situations!\n\nWhen midnight struck, the chat exploded with celebratory messages. Hubert was likely shooting off imaginary fireworks while Jake, who was in a “no hangover” condition thanks to his gallon jug of water, shared his victory over the previous night’s festivities. \"Today is a good day to figure out how to use the double breakfast sandwich maker I got for Christmas,\" he tweeted, which was met with a mix of admiration and teasing about cooking skills.\n\nAs the holiday haze began to lift, Bront shared exciting news about moving into a spacious new apartment. \"Just put a deposit in on the apartment, boys!\" he announced, to which Hubert replied with enthusiasm, \"Ayy!\" Bront laid out the plans for his living space, hinting at a possible office nook that would take up \"25% of that living room.\" The anticipation of new beginnings filled the chat with warmth and excitement.\n\nThe conversations shifted from personal milestones to the pop culture realm, where they dissected the finale of the Mandalorian. \"The battle droids being goofy has me so triggered,\" Nudey shared, while Hubert reassured everyone that Clone Wars was worth the watch, given its ties to the Mandalorian universe. \n\nMeanwhile, TV mounting woes became a running gag, especially when Jake recounted his struggle: “I zoomed the drill some more and the screws wouldn’t screw.” The group erupted in laughter as they rallied around him, offering helpful advice while ribbing him about being unable to mount a TV properly, with Randy quipping, \"All this time Kurtz said he was blue collar.\" \n\nAs the week progressed, the reality of returning to work set in, and many expressed their \"New Year’s Day scaries.\" Juulio shared his experience rolling on Molly and regretting it the next day, while others lamented the volume of emails awaiting them. “Holy shit the New Year’s Day scaries are terrifying,” he exclaimed, resonating with the collective post-holiday blues.\n\nBront, now officially a solo apartment dweller, shared his plans for setting up his new space. “I’m trying to figure out how to do some stupid modifications to it so I can expense it and call it a project lol,” he joked, reflecting the light-hearted banter that characterized the group’s dynamic.\n\nOver"
    },
    {
        "week_starting": "2020-01-06",
        "week_ending": "2020-01-12",
        "summary": "# Weekly Recap: January 6 - January 12, 2020\n\n## Summary Section:\n\n### Key Highlights:\n- **Movie Discussions:** \"Ford v Ferrari\" received mixed reviews, igniting a lively debate.\n- **Bront's Truck Adventures:** Bront prepped for his driving debut in a truck, leading to humorous exchanges about driving mishaps.\n- **Political and Pop Culture Commentary:** The group shared their takes on Ricky Gervais's Golden Globes speech and the current political climate.\n- **Personal Life Updates:** Robert announced a breakup, prompting heartfelt and humorous support from the group.\n- **Brewing and Food Plans:** Nudey and Hubert discussed brewing plans for the weekend, while others shared food cravings and recommendations.\n\n### Main Topics of Discussion:\n1. **Movies:** \n   - Debate over \"Ford v Ferrari,\" with mixed opinions on its quality.\n2. **Driving Experiences:**\n   - Bront's impending truck driving and the associated fears from other group members.\n3. **Current Events:**\n   - Reactions to Ricky Gervais's comments and the ongoing political climate, including humorous takes.\n4. **Personal Updates:**\n   - Robert's breakup led to discussions about relationships and emotional support.\n5. **Brewing and Cooking:**\n   - Plans for brewing beer and cooking, with various food cravings being shared.\n\n### Emotional States:\n- **Humor and Sarcasm:** The group maintained a light-hearted tone with jokes about movies, driving, and politics.\n- **Supportive:** The mood shifted to supportive when Robert shared his breakup news, with friends rallying around him.\n- **Nostalgic and Reflective:** Discussions about past experiences, especially Bront's truck driving and Robert's relationship, evoked nostalgia.\n\n### Controversies:\n- **Political Debates:** Heated discussions arose over political comments and the interpretations of current events, especially related to the ongoing tensions with Iran.\n- **Breakup Responses:** Mixed reactions to Robert's breakup led to some light-hearted teasing and serious advice.\n\n### Personal Updates and Life Events:\n- **Robert's Breakup:** After 16 months of dating, Robert's girlfriend expressed doubts about their future, leading to emotional discussions.\n- **Bront's Move:** Bront is in the process of moving, leading to both excitement and anxiety about the transition.\n\n### Best Line of the Week:\n\"Imagine being happy!\" - Aaron D, responding to humorous comments about the absurdity of life.\n\n---\n\n## Narrative Section:\n\nWhat a week it was for the crew! It all kicked off with a heated debate about the latest car flick, \"Ford v Ferrari.\" The opinions were as divided as the group chat itself, with Juulio Jones claiming it was \"good af,\" while others like Hubert Cumberdale were quick to dismiss it. The back-and-forth was classic, mirroring their usual banter about pop culture and personal preferences.\n\nAs the week unfolded, Bront's upcoming truck driving adventure became a focal point. The man was ready to take the wheel and speed off to the gas station for cashews, much to everyone's amusement. \"Let me know what time so I can stay off the road!\" Randy quipped, and the truck-driving metaphors began rolling in. With driving tales reminiscent of a sitcom, the group rallied around Bront, offering both support and playful jabs at his apparent lack of experience.\n\nIn the background of all this, the political climate was as charged as ever. Ricky Gervais's Golden Globes speech was dissected like a fine wine, with Brums leading the charge in commentary about Hollywood's follies. Amidst the humor, there were deeper reflections on the state of current events, with group members sharing their thoughts on the ongoing tensions in the Middle East. \"A man has fallen into the river in Lego City,\" Hubert Cumberdale cleverly remarked, keeping the tone light even when the topics were heavy.\n\nThen came the emotional rollercoaster of Robert's breakup, which hit the group hard. \"You had like no issues prior?\" Aaron D asked, trying to wrap his head around the sudden change. The camaraderie was palpable as friends rallied to support Robert, exchanging heartfelt messages and the occasional joke to lighten the mood. \"Round up the boys and hit up the casino and titty bar!\" was one of the lighter suggestions, showing the group's knack for using humor to cope with tough times.\n\nAmidst all this, the brewing plans for the weekend bubbled up, with Nudey and Hubert discussing their beer concoction. The thought of a weekend brewing session brought a sense of excitement, a welcome distraction from the week's emotional weight. \n\nAs Friday rolled around, the group reflected on their week, sharing everything from food cravings to plans for the weekend. Robert even joked about needing Arby’s after a night of debauchery, showcasing the group's love for food as a comfort tool. \n\nAll in all, it was a week filled with laughter, support, and the occasional existential crisis—a perfect snapshot of friendship in action. Whether they were debating movies, sharing"
    },
    {
        "week_starting": "2020-01-13",
        "week_ending": "2020-01-19",
        "summary": "# Weekly Recap: January 13 - January 19, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Bront's Big Move**: Bront officially moved into a new apartment, marking a significant life change.\n- **Culinary Adventures**: Multiple discussions about food, including pizza, ribs, and a variety of cooking experiments.\n- **Job and Career Updates**: Several members, including Robert and Aaron, shared updates about job applications and interviews.\n- **Pop Culture Banter**: The group had fun discussing movies like *Uncut Gems* and *1917*, while also sharing thoughts on the latest political happenings.\n\n### Main Topics of Discussion:\n1. **Bront's Move**: The excitement and challenges of moving into a new place.\n2. **Food and Cooking**: Recipes, cooking fails, and the joys of frozen pizza vs. homemade meals.\n3. **Job Talks**: Career moves and interviews, particularly Robert’s potential FBI test and Aaron’s upcoming Google call.\n4. **Pop Culture**: Reflections on recent movies, including *Uncut Gems* and *The Outsider*, along with light-hearted political commentary.\n\n### Emotional States:\n- **Excitement**: Bront's move brought a sense of excitement and optimism.\n- **Humor**: The group maintained a light-hearted and humorous tone throughout the week, especially during discussions about food and personal anecdotes.\n- **Anxiety**: There were moments of anxiety related to job applications and interviews.\n\n### Controversies:\n- **Political Discussions**: Some heated debates arose over candidates in the upcoming elections, particularly regarding Bernie Sanders and Andrew Yang.\n- **Fashion Disputes**: A lively debate about shoe brands, with strong opinions on Jay Butler and Allen Edmonds.\n\n### Personal Updates and Life Events:\n- **Bront**: Moved into a new apartment and expressed mixed feelings about leaving NYC.\n- **Robert**: Shared news about being invited to take an FBI test, leading to jokes about him being a \"Fed.\"\n- **Aaron**: Had an important call scheduled with Google, leading to nervous banter among the group.\n\n### Best Line of the Week:\n“Golf is too affordable for the minorities!” - A cheeky comment by Aaron that sparked laughter and light-hearted debate.\n\n---\n\n## Narrative Section\n\nWhat a week, friends! This week kicked off with Bront making a big move into a new apartment—goodbye Brooklyn, hello New Bedford! There were mixed feelings in the group as Bront shared nostalgic memories of NYC while also expressing relief at escaping NYU this semester. The excitement was palpable, and the group couldn't resist joking that Bront's new place would soon be the site of their next big get-together.\n\nFood was a running theme throughout the week, with Jack cooking up his infamous \"one pot hamburger helper,\" which quickly turned into a meme of its own. Hubert chimed in with his love for frozen pizza, and the group had a hilarious back-and-forth about who had the best cooking skills—or lack thereof. Robert and Aaron bonded over ribs they had each made, showcasing their culinary prowess. \n\nIn the midst of all this, Robert dropped the bombshell that he got invited to take the FBI test. The group erupted in jokes about him becoming a \"Fed\" and how they might have to kick him out of the chat if he ended up working for the government. The banter reached a peak when Aaron humorously claimed, “If they ask about me, we never met, okay?” \n\nMeanwhile, Aaron prepared for a nerve-wracking call with Google, prompting the group to share their own job-related anxieties. The humor helped ease the tension, with members sharing stories of their own work experiences, and the camaraderie was infectious. \n\nPop culture also found its way into the chat, as members dissected the intense *Uncut Gems* and praised the cinematography of *1917*. Bront even humorously remarked that *Uncut Gems* was basically his life, which drew nods and laughter from the group. \n\nAs the week wrapped up, the group was buzzing with anticipation for the weekend. With Bront's new digs ready for visitors, plans were already in motion for a small housewarming to celebrate their friend’s new chapter. Amidst the jokes, food discussions, and the occasional controversy over politics and fashion, the camaraderie and humor that defines this group shone brightly.\n\nHere’s to another week of laughs, food, and the ups and downs of life! Keep it real, gang!"
    },
    {
        "week_starting": "2020-01-20",
        "week_ending": "2020-01-26",
        "summary": "# Weekly Recap: January 20, 2020 - January 26, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Pizza Debate:** The ongoing discussion about cooking the perfect pizza in cast iron, with Randy and Dennis sharing their preferences for toppings and methods.\n- **Robert's Date:** Robert had a successful date at a coffee shop and a brewery, leading to enthusiastic updates from the group.\n- **Michael's Job:** Michael announced he got a job as a central banker in Singapore, leading to celebratory messages from the group.\n- **Brums' Teaching Experience:** Brums taught his first class, which he humorously described as a success, letting students out early.\n- **Kobe Bryant's Tragic Death:** The week ended on a somber note with the news of Kobe Bryant's helicopter crash, prompting reflections and condolences from the group.\n\n### Main Topics of Discussion:\n1. **Cooking and Food:** Cast iron versus pizza stones, with various personal anecdotes about cooking experiences.\n2. **Relationships:** Updates on Robert's date and thoughts on dating dynamics in the group.\n3. **Career Moves:** Celebrations for Michael's new job and discussions about internships and job hunting.\n4. **Entertainment:** Discussions around gaming, TV shows (like \"Always Sunny\"), and the upcoming release of \"Altered Carbon\".\n5. **Tragic News:** The impact of Kobe Bryant's death on the group and shared memories of his legacy.\n\n### Emotional States:\n- The mood fluctuated from light-hearted banter and humor regarding pizza and cooking to excitement over personal milestones, culminating in sadness and reflection over Kobe Bryant’s death.\n\n### Controversies:\n- A few debates arose regarding pizza toppings (especially the classic pineapple debate) and the merits of different cooking methods.\n- Jack's unpopular opinion about \"It's Always Sunny in Philadelphia\" sparked some debate among friends.\n\n### Personal Updates and Life Events:\n- **Michael Wee:** Got a job as a central banker in Singapore, prompting a wave of congratulations.\n- **Robert Esswein:** Shared updates from his date and expressed joy over his new romantic interest.\n- **Brums:** Successfully taught his first class and shared his outfit details, which led to humorous discussions.\n\n### Best Line of the Week:\n\"Imagine trying to dig like one penny out of that long butt pocket. You’d look like you were digging in your ASS!\" - Randy\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc:\nOh boy, did this week have it all! Starting off with a classic debate about pizza, Randy and Dennis were at it again, extolling the virtues of cast iron versus stone. As they argued over toppings—Randy firmly in the hot ground sausage camp while Dennis championed the fresh mozzarella—it felt like a culinary showdown. Meanwhile, Robert was abuzz after his date at a cozy coffee shop followed by a brewery outing. He shared his excitement, and the group cheered him on, joking that he needed to be careful about sharing too many hot pics of his date in the group chat!\n\nAs the week progressed, the mood shifted dramatically with Michael delivering the exciting news that he landed a job as a central banker in Singapore. The group erupted in congratulatory messages, noting how he had gone from being our resident grad student to a central banker—a serious glow-up!\n\nBrums also had a notable week, stepping into his role as a teacher for the first time. He humorously let out his students early, which the group totally supported, dubbing him the “cool teacher.” His outfit of a black turtleneck and jeans earned compliments, with Randy quipping that it was a \"strong fit.\"\n\nHowever, the week took a somber turn with the tragic news of Kobe Bryant’s helicopter crash, which hit the group hard. As they shared their reactions and reflected on Kobe’s impact, the chat shifted from laughter to heartfelt conversations, reminding everyone of the fragility of life.\n\n### Character Spotlights:\n- **Randy:** The unofficial chef of the group, always ready to defend his pizza-making methods and share a laugh.\n- **Dennis:** The pragmatist, offering insights into the world of cooking while keeping the pizza debate light.\n- **Robert:** The romantic, sharing updates on his date and navigating the dating scene with humor and charm.\n- **Michael:** The ambitious one, celebrating his new job and future in banking with good-natured ribbing from the group.\n- **Brums:** The educator, who navigated his first class like a pro, letting students out early and garnering admiration from his peers.\n\n### Humorous Moments:\nThe pizza debates led to some of the best one-liners of the week, especially Randy’s comment about the struggles of digging for loose change. Other gems included the classic ribbing about who gets to be the \"cool teacher\" and the playful banter over golf and dating advice, which always seems to spiral into hilarity.\n\nIn the midst of this, Aaron humorously mentioned how he felt more “gay” (happy) as he recovered from illness, leading to a cascade of playful"
    },
    {
        "week_starting": "2020-01-27",
        "week_ending": "2020-02-02",
        "summary": "# Weekly Recap: January 27 - February 2, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Kobe Bryant's Tragic Death:** The group reacted to the shocking news of Kobe's passing in a helicopter crash, leading to discussions about aviation safety.\n- **Bront's Loss:** Bront shared the news of his grandfather’s passing, marking a somber moment for the group.\n- **Aaron's Tax Refund Revelation:** Aaron teased about his unexpected tax refund, hinting at a potential Rolex purchase.\n- **Juulio Jones' Weekend Adventure:** Juulio shared his experiences at the Waste Management Open in Phoenix, complete with funny interactions.\n\n### Main Topics of Discussion:\n- **Movies & Pop Culture:** Conversations ranged from discussing \"Once Upon a Time in Hollywood\" to the impact of Stephen King's new series on HBO.\n- **Internships and Job Hunting:** Jack discussed his potential internship options, and Bront shared insights about his upcoming academic year.\n- **Travel Plans:** Several members shared their upcoming travel plans, with a focus on skiing and visiting breweries.\n\n### Emotional States:\n- **Mixed Emotions:** The week had a mix of humorous moments and serious reflections, especially following Kobe's death and Bront's loss.\n- **Light-Hearted Banter:** The group maintained a generally light-hearted atmosphere despite serious discussions, with plenty of inside jokes.\n\n### Controversies:\n- **Discussions about Relationships:** Jack and his girlfriend's emotional disagreement sparked some debate about gender dynamics and emotional responses.\n- **Debate on Helicopter Safety:** The group deliberated on the responsibilities of helicopter pilots and the implications of recent tragedies.\n\n### Personal Updates and Life Events:\n- **Bront's Grandfather Passed Away:** The group expressed sympathy and support for Bront during this difficult time.\n- **Aaron's Financial Windfall:** Aaron hinted at a larger-than-expected tax refund, sparking discussions about spending it on luxury items.\n- **Jack's NCAA Coaching:** Jack announced his new role as an assistant NCAA coach, marking a significant milestone.\n\n### Best Line of the Week:\n“Imagine being able to fly anywhere in the sky and hitting the most stationary object in existence.” - Hubert Cumberdale\n\n## Narrative Section\n\nThe week kicked off on a somber note as news broke about the tragic death of basketball legend Kobe Bryant. The group was quick to share their shock and disbelief, with Hubert diving into a detailed analysis of the helicopter crash, discussing pilot error and safety protocols. “Imagine being able to fly anywhere and hitting the most stationary object,” he mused, setting a reflective tone for the week.\n\nMeanwhile, Bront opened up about the passing of his grandfather, a moment that resonated deeply with the group. This shared experience of loss allowed everyone to rally around Bront, offering their condolences and support, reminiscent of the camaraderie they've built over the years.\n\nAmidst the heavier conversations, Aaron dropped a bombshell about his tax refund, which turned out to be much larger than expected. “Rolex time might be coming soon,” he joked, eliciting laughter and playful jabs from the gang. The idea of Aaron flaunting a fancy watch became an ongoing joke, particularly when Randy chimed in with his classic quips about taxes and government woes.\n\nJack was busy navigating the complexities of relationship dynamics, sharing an amusing yet chaotic story of his girlfriend getting upset over TikTok. “I don’t get women’s emotions,” he lamented, prompting a flood of responses that ranged from empathetic to hilariously irreverent, as the guys debated the merits of emotional intelligence versus sheer bewilderment.\n\nAs the week progressed, Juulio Jones recounted his wild experiences at the Waste Management Open in Phoenix, providing comedic relief with tales of blue-haired golf fans and his attempts to score good seats. “We snuck into 16!” he triumphantly declared, which was met with cheers and some friendly jealousy from the group.\n\nAmidst all the laughs and light-hearted banter, the group also discussed their future plans. Jack mentioned his aspirations for an internship, and Bront shared a newfound clarity about his academic trajectory, reassuring the group that he was on track for success despite the recent loss. “I need to knock out that research before I even defend,” he said, showing determination despite the challenges ahead.\n\nThe week wrapped up with some classic banter about food, with Randy’s love for Taco Bell and Bront’s affinity for bagels sparking a heated debate. “Taco Bell is garbage!” Dennis exclaimed, only to be met with laughter and a chorus of “sometimes you want the garbage.”\n\nThrough it all, the group’s humor and support for one another shone brightly, proving once again that even in the face of tragedy, they could find solace and laughter together. Here’s to another week of inside jokes, heartfelt moments, and the bond that keeps them all connected"
    },
    {
        "week_starting": "2020-02-03",
        "week_ending": "2020-02-09",
        "summary": "# Weekly Recap: February 3 - February 9, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Super Bowl Shenanigans**: A lively discussion around the Super Bowl, including frustrations with pizza and TV shopping.\n- **Nudey's California Trip**: Nudey prepares for a work trip to California and shares experiences with office culture and food.\n- **Jack's Relationship Drama**: Jack shares his relationship issues, stirring up a heated debate on emotional validation and communication.\n- **Upcoming Events**: Discussions about the XFL and other upcoming social outings, including potential meetups.\n\n### Main Topics of Discussion:\n1. **Super Bowl Party**: The group recapped their Super Bowl experiences, highlighting pizza failures and NFL controversies.\n2. **Work and Travel**: Nudey's upcoming work trip and the stresses of remote work were discussed.\n3. **Relationship Dynamics**: Jack's relationship woes led to a broader conversation about expectations and emotional support in relationships.\n4. **Sports**: Excitement over the XFL's debut and discussions about favorite teams and players.\n\n### Emotional States:\n- **Humor and Frustration**: The chat was filled with jokes, particularly about the Super Bowl and Jack's relationship issues.\n- **Conflict and Reflection**: Jack's story brought a mix of empathy and criticism from the group, highlighting different perspectives on emotional communication.\n\n### Controversies:\n- **Jack's Relationship Issues**: Heated debates over Jack's handling of emotions and expectations in his relationship with Maddy.\n- **Super Bowl Controversies**: Disagreements on officiating and game calls added a competitive edge to the discussions.\n\n### Personal Updates and Life Events:\n- **Nudey's Work Trip**: Preparing for a trip to California for work, sharing excitement about food experiences.\n- **Jack's Relationship**: Sharing the ups and downs of his relationship with Maddy, including awkward encounters and emotional discourse.\n- **Bront's Apartment Hunt**: Discussing living situations and the challenges of finding affordable housing.\n\n### Best Line of the Week:\n\"Imagine getting a good night's sleep.\" - Jake Kurtz, in reference to the chaotic lives they all lead.\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc\nThe week kicked off with the aftermath of the Super Bowl. The group was buzzing with mixed emotions as they recounted their Super Bowl Sunday experiences. Nudey lamented over his failed pizza order and his TV shopping woes, while Randy humorously commented on the absurdity of waiting for customer service at Best Buy. As the conversation flowed, it became clear that while some were reveling in the festivities, others were left feeling like they needed a Super Bowl recovery plan.\n\nAmidst the sports chatter, Nudey prepared for his work trip to California. The group rallied around him, sharing inside jokes and offering tips on how to navigate the office culture he would encounter. Nudey’s excitement about trying Kenji's restaurant was palpable, and it sparked a lighthearted debate about the best places to eat in San Francisco.\n\nMeanwhile, Jack’s relationship drama took center stage. His struggles with Maddy's emotional needs led to a deep dive into relationship dynamics. The group offered a mix of advice, humor, and their own experiences, creating a lively discussion that showcased their tight-knit bond. Jack's situation became a mirror reflecting their own relationship challenges, with members chiming in with both empathy and critiques. \"All it takes is one bad day,\" Hubert quipped, eliciting laughter and reflective nods from the group.\n\nAs the week progressed, the buzz shifted towards the XFL. Excitement filled the air as they anticipated the league's debut. The banter was at an all-time high, with humorous predictions and discussions about team mascots. \"I want on-field interviews,\" Juulio exclaimed, echoing the group's desire for a more interactive viewing experience. The camaraderie was infectious as they rallied around their chosen teams, with Hubert proudly declaring his loyalty to the Battlehawks.\n\n### Character Spotlights\n- **Nudey**: The adventurous spirit, excited about his upcoming California trip and food adventures, while dealing with the chaos of remote work.\n- **Jack**: The emotionally charged relationship guru of the group, navigating the complexities of his romantic life while drawing in the group's attention and advice.\n- **Randy**: The humorous commentator, always ready with a witty remark and a knack for turning serious discussions into light-hearted banter.\n- **Hubert**: The analytical thinker, often grounding discussions with his insights, while also bringing a playful spirit to the group's dynamics.\n\n### Humorous Moments\nThroughout the week, inside jokes and playful jabs kept the mood light. Nudey's frustration over his failed TV shopping turned into a meme-worthy moment, with Randy cheekily suggesting he just needed to get drunk to forget his woes. Jack's relationship "
    },
    {
        "week_starting": "2020-02-10",
        "week_ending": "2020-02-16",
        "summary": "# Weekly Recap: February 10 - February 16, 2020\n\n### Summary Section\n\n**Key Highlights:**\n- Group discussions about the Oscars and predictions, with various humorous comments and predictions.\n- Conversations about personal milestones, including Hubert starting a training regimen and Bront's academic accomplishments.\n- Planning for a group trip to the Kentucky Derby, with various members discussing travel arrangements and logistics.\n- A mix of humorous banter regarding food preferences, political opinions, and inside jokes about past events.\n\n**Main Topics of Discussion:**\n1. **Oscars Predictions:** The group shared their thoughts and predictions about the winners, with a particular focus on \"Isle of Dogs\" for Best Animated Feature.\n2. **Personal Updates:** Hubert started training for a 5k, and Bront paid his tuition out of pocket for the semester.\n3. **Travel Plans:** A proposed trip to Cincinnati for the Derby, with discussions about flights, accommodations, and logistics.\n4. **Food and Drink:** Humorous exchanges about food choices, including Little Caesars and the ongoing debate over the best pizza.\n\n**Emotional States:**\n- **Humor:** Lots of jokes about food, personal anecdotes, and political commentary.\n- **Frustration:** Some members expressed frustration over job situations and political issues.\n- **Excitement:** Buzz surrounding the upcoming Derby trip and personal achievements.\n\n**Controversies:**\n- Disagreements about political views, especially regarding the Oscars and who should win.\n- Banter about personal relationships, particularly Tom's dating situation which led to some playful teasing.\n\n**Personal Updates and Life Events:**\n- **Hubert:** Started training for a 5k and shared milestones on his running.\n- **Bront:** Announced he paid for his semester tuition out of pocket.\n- **Tom:** Discussed his relationship with Veronika and navigating the age difference.\n- **Juulio:** Mentioned potential job changes and personal reflections on past relationships.\n\n**Best Line of the Week:**\n\"Imagine hanging out with ur gf on Valentine’s Day instead of playing video games.\" - Hubert Cumberdale\n\n---\n\n### Narrative Section\n\nWhat a wild week it’s been for the gang! Kicking off with the Oscars on Monday, the group couldn't help but dive into predictions and banter about who would take home the coveted golden statuettes. **Aaron D** was feeling particularly bold, predicting “Isle of Dogs” would snag Best Animated Feature, while **Bront** shared a hilarious meme about the absurdity of the awards. “Brad Pitt fucks CMM” had everyone rolling, ensuring that laughter was the theme of the night.\n\nAs the week progressed, **Hubert Cumberdale** announced he started training for a 5k, proudly declaring he ran a faster mile than he had in ages. The “Little Caesars” diet might be on hold, as he jokingly bemoaned the lack of decent pizza options in his area. Meanwhile, **Bront** was riding high after managing to pay for his semester tuition out of pocket. “Guess who’s adulting now?” he quipped, to the group’s applause.\n\nAmidst the chatter about personal victories, the most exciting development was the planning of the gang’s trip to the Kentucky Derby. **Hubert** took charge, coordinating flights and accommodations, while **Nudey** excitedly jumped in, eager to book his ticket. “Finally used some of my credit card points!” he exclaimed, clearly thrilled about the impending adventure. The prospect of betting on horses and drinking mint juleps had everyone buzzing with anticipation.\n\nOf course, no week in this group would be complete without some classic inside jokes and playful ribbing. **Tom** navigated his budding relationship with Veronika, which led to some funny yet insightful discussions about age differences. “What’s the worst that could happen?” he asked, to which **Randy** replied, “She might just be avoiding the topic because she’s closer to 30!” \n\nOn the culinary front, food discussions ranged from the merits of **Little Caesars** (which was a hotly debated topic) to **Aaron’s** love for “health and safety” laws ruining his pizza experiences. **Jake Kurtz** chimed in with his trademark wit, suggesting that if you can’t find a Little Caesars, you can always substitute it with **Canes**. “Sounds like you shouldn’t be living where you are,” he quipped, sparking a lively discussion about fast food chains and regional specialties.\n\nAs the week wrapped up, the excitement for the Derby remained palpable, with reminders to book flights and finalize details. “This derby about to be lit!” **Hubert** declared, and the group could hardly contain their enthusiasm. \n\nAnd just like that, amidst the laughter, food debates, and the thrill of upcoming travels, the week felt like a whirlwind of camaraderie that only this group could pull off. Here’s to more wild adventures and endless inside jokes!"
    },
    {
        "week_starting": "2020-02-17",
        "week_ending": "2020-02-23",
        "summary": "# Weekly Recap: February 17 - February 23, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Mountain Weekend:** Jack Lonneman's group navigated a cold and chaotic mountain weekend, filled with unexpected challenges and humorous stories.\n- **Bernie Sanders Wins Nevada:** The group discussed the implications of Bernie Sanders’ victory in the Nevada caucus, with various opinions on his candidacy.\n- **Personal Milestones:** Michael Wee excitedly shared about his significant signing bonus, and Bront secured his security deposit back from NYC.\n- **Tournament Debacle:** Nudey’s soccer team faced a tough tournament, leading to a -30 goal differential after three games.\n\n### Main Topics of Discussion:\n1. **Nascar and Racing:** A lively debate about recent Nascar races, drivers, and the culture surrounding it, including memes and personal experiences.\n2. **Gift Giving:** Jack’s dilemma over birthday gifts for Maddy sparked discussions on creativity and expectations in relationships.\n3. **Political Climate:** Conversations about Bernie Sanders' rise in the Democratic primaries and the group's humorous takes on political figures.\n4. **Personal Updates:** Members shared life updates, including job news, travel plans, and roommate dramas.\n\n### Emotional States:\n- The group experienced a range of emotions, from **humor** over Jack’s cold mountain trip to **anxiety** regarding Nudey's tournament performance. \n- There were moments of **celebration** for personal achievements, like Bront’s return of his security deposit and Michael’s bonus.\n\n### Controversies:\n- A heated debate ensued regarding the appropriateness of a Dutch soccer coach being fired over using a racial slur in a song context, with differing opinions on cultural sensitivities.\n- Discussions around Bernie Sanders’ candidacy led to lighthearted yet pointed disagreements about political correctness and the effectiveness of his policies.\n\n### Personal Updates and Life Events:\n- **Michael Wee** shared he received a $90k signing bonus and is considering big purchases.\n- **Bront** finally got his NYC security deposit back after some frustrating calls.\n- **Nudey** had a rough time at his soccer tournament, leading to some comical self-reflection.\n\n### Best Line of the Week:\n\"Imagine having to drive to Fort Worth for your racing.\" – Jake Kurtz, humorously critiquing the lengths involved in attending Nascar events.\n\n---\n\n## Narrative Section\n\nAh, what a week it was for the crew! Kicking off on a relaxed Monday, the humor was palpable as the boys shared awful nascar memes that sparked the usual banter. Aaron D, ever ready to \"get weird,\" initiated a wave of conversations that ultimately landed on Jack's chaotic mountain weekend.\n\nAs the week unfolded, we found Jack Lonneman in a bit of a pickle. His mountain weekend with Maddy started cold—literally. With the temperatures dipping into the single digits, Jack and his friends faced a cabin without heat or proper amenities. Just imagine: an entire group of college kids bundled up, trying to stay warm, and inevitably, stories of their “close encounters” of the cold kind began circulating. Jack's proclamation, “We’re sleeping in the car,” had us all in stitches. \n\nMeanwhile, in the political arena, the group got to dissect Bernie Sanders’ Nevada win. Opinions flew fast and furious, with Randy quipping about the Russians propping Bernie up. The political discourse was both animated and absurd, as usual. The group’s comical take on serious subjects is what we do best, and this week was no different!\n\nBront had a bit of good news with his security deposit finally returned, leading to a celebratory atmosphere. “Thank god,” he exclaimed, recalling the trials of dealing with various representatives on the phone. “Of course, it’s signed by someone different every time I called,” he added, leading to jokes about the “classic bait and switch” theme.\n\nNudey had less luck on the tournament front, as his soccer team faced off against some serious competition, ultimately ending up with a -30 goal differential. “So maybe that’s a no,” he said, when asked if they were winning. It was a tough pill to swallow, but the humor in their misfortune provided some much-needed laughs during the week.\n\nAs the weekend rolled in, Jack's plans to redeem the mountain weekend with a spontaneous hike led to more hilarious exchanges about outdoor adventures. \"We’re headed to Rainbow Falls!\" he declared, and it felt like a fitting finale to a week filled with ups, downs, and plenty of laughs.\n\nAmidst all the chaos, there were heartwarming moments of camaraderie. Aaron D's quirky messages, filled with auto-correct fails and memes, kept everyone on their toes. The group rallied together, sharing stories, providing moral support, and cracking jokes, making the week one for the books.\n\nIn the end, whether it was discussing the nuances of racing, debating political candidates, or swapping advice on gifts and life, this week showcased the unique bond of our group"
    },
    {
        "week_starting": "2020-02-24",
        "week_ending": "2020-03-01",
        "summary": "## Weekly Recap (February 24 - March 1, 2020)\n\n### Summary Section\n\n**Key Highlights:**\n- **Food Adventures:** Bront and Dennis discussed the pizza scene, particularly the legendary Sally’s Apizza.\n- **Life Changes:** Jack Lonneman had a successful interview for a golf pro position at Sankaty Head.\n- **Controversies & Discussions:** The group debated the politics surrounding the 2020 election, particularly the implications of Pete Buttigieg dropping out.\n- **Group Dynamics:** Jack faced roommate drama as he was unexpectedly kicked out, leading to discussions about friendship and living situations.\n- **Health Concerns:** The group shared concerns about the coronavirus, especially regarding travel plans and public gatherings.\n\n**Main Topics of Discussion:**\n- **Food:** Pizza preferences and takeout experiences dominated early chats, including Bront's love for East Coast pizza.\n- **Relationships and Politics:** The group engaged in extensive commentary about political candidates and their campaigns, especially around Super Tuesday.\n- **Housing Woes:** Jack Lonneman's roommate situation created a significant conversation about friendships and living arrangements.\n- **Health Issues:** Discussions on the coronavirus and its impact on daily life and events sparked anxiety.\n\n**Emotional States:**\n- **Humor and Sarcasm:** The mood was generally light, filled with jokes about food, politics, and personal anecdotes.\n- **Anxiety and Concern:** Conversations about the coronavirus and Jack's housing situation brought moments of seriousness.\n\n**Controversies:**\n- **Roommate Drama:** Jack's abrupt eviction from his living situation was met with mixed feelings from the group, leading to discussions about fairness and friendship.\n- **Political Discussions:** Differences in political opinions regarding candidates stirred some debates.\n\n**Personal Updates and Life Events:**\n- **Jack Lonneman's Interview:** Jack secured an interview at Sankaty Head and expressed optimism about the opportunity.\n- **Randy's BBQ Prep:** Randy prepared for a huge BBQ event, cooking 240 pieces of meat, illustrating the group's ongoing culinary adventures.\n- **Robert's New Place:** Robert discussed moving into a new luxury apartment, generating excitement and advice from the group.\n\n**Best Line of the Week:**\n“Imagine if they turned every 'Vampire Weekend' song into a real thing. That's what it's like there.” - Bront.\n\n---\n\n### Narrative Section\n\nThis week was nothing short of an East Coast spectacle, highlighted by food, political banter, and just a dash of personal drama. It kicked off with Bront and Dennis diving deep into the pizza scene, particularly the legendary Sally’s Apizza. Bront, always the connoisseur, passionately defended his favorite spots, claiming they outshine even the esteemed NYC joints. Meanwhile, Dennis was just happy to be included in what he dubbed “an East Coast Moment.”\n\nAs the week unfolded, the group pivoted from food to more pressing matters—the 2020 election. It was a rollercoaster of emotions when Pete Buttigieg dropped out of the race, leading to a flurry of opinions and memes. Brums chimed in with his analysis, while Jack Lonneman couldn’t help but express surprise that Tulsi Gabbard was still in the mix, humorously suggesting she might outlast the entire election cycle.\n\nIn the midst of all this, Jack found himself in a precarious situation. His roommates decided to cut him from their living arrangements, citing a laundry mishap as the last straw. The group rallied around him, offering both support and a healthy dose of “you’re better off without those losers.” It was a classic moment of camaraderie, underscoring the importance of true friendships in the face of adversity.\n\nMeanwhile, Randy was busy prepping for a colossal BBQ event, cooking 240 pieces of meat—that's right, 120 burgers and 120 hot dogs. The group couldn’t help but toss around bets on how many he would actually finish before needing to hurl. Classic Randy, always the culinary adventurer, brought laughter as he recounted his plan to stock up for the impending coronavirus quarantine. \n\nSpeaking of the virus, the topic made its way into the chat as the group expressed concerns about upcoming travel plans and public gatherings. There was a growing sense of anxiety, but true to form, they lightened the mood with jokes and memes about stocking up on essentials.\n\nAs the week wrapped up, Jack received some good news—he had a fantastic interview for a golf pro position at Sankaty Head. The group cheered him on, envisioning a future where Jack was living the dream, rubbing elbows with the elite while sharing tales of his roommate drama.\n\nWith a mix of food, politics, and personal milestones, this week encapsulated the vibrant, chaotic energy of the group, reminding everyone that no matter the challenges, there’s always room for humor and support amongst friends. Here’s to more pizza debates, political rants, and BBQ escapades in the weeks to come!"
    },
    {
        "week_starting": "2020-03-02",
        "week_ending": "2020-03-08",
        "summary": "# Weekly Recap: March 2 - March 8, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Political Discussions**: The group was heavily engaged in discussions about the Democratic primaries, particularly the unexpected outcomes involving candidates like Mayor Pete, Biden, and Bernie.\n- **COVID-19 Concerns**: The conversation shifted significantly towards the COVID-19 pandemic, with various members sharing updates, concerns, and humorous takes on the situation.\n- **Personal Updates**: Several members shared personal milestones, including new jobs, relationship developments, and travel plans.\n- **Inside Jokes**: The week saw plenty of inside jokes, especially around the themes of preparation for the pandemic, past funny incidents, and humorous political commentary.\n\n### Main Topics of Discussion:\n1. **Political Landscape**: The primaries took center stage with debates about candidate viability and the implications of their dropouts.\n2. **COVID-19 Updates**: The group discussed the coronavirus outbreak, with humorous and serious takes on the situation, as well as personal preparations.\n3. **Personal Milestones**: Members shared updates about their jobs, relationships, and upcoming trips, fostering a sense of community and support.\n4. **Pop Culture References**: Discussions of beer, gaming, and various media also featured prominently, highlighting shared interests.\n\n### Emotional States:\n- **Humor and Sarcasm**: Despite the serious nature of the topics, the mood remained light-hearted with plenty of jokes and banter.\n- **Concern and Anxiety**: There were moments of genuine worry about the implications of COVID-19 and its impact on daily life.\n- **Excitement and Anticipation**: Personal updates about new jobs and events sparked excitement and supportive messages from the group.\n\n### Controversies:\n- **Political Disagreements**: There were recurring debates about the political candidates and their policies, with some members expressing frustration over the outcomes of the primaries.\n- **Pandemic Preparedness**: Some members mocked those who were overly anxious about COVID-19, leading to a few light-hearted disagreements about the seriousness of the situation.\n\n### Personal Updates and Life Events:\n- **Michael Wee**: Started a new job and shared his first-day experiences.\n- **Jack Lonneman**: Discussed his excitement about getting new golf clubs and his upcoming work responsibilities.\n- **Nudey**: Attended a baking class, sharing humorous reflections about it.\n- **Bront**: Mentioned plans to visit siblings and discussed his living arrangements.\n\n### Best Line of the Week:\n\"Imagine flying around this time 😂😂😂\" - Hubert Cumberdale, reflecting the absurdity of travel during a pandemic.\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc:\nAs the first week of March rolled in, the group jumped headfirst into the chaotic world of politics. The primaries were heating up, and everyone had an opinion. Jake Kurtz was baffled by the sudden dropouts of candidates like Mayor Pete and Biden's surprising surge, while Randy offered his signature sarcastic commentary on the political landscape. “Who actually thought this was going to happen?” he mused, to which the group responded with a mix of memes and genuine shock.\n\nBut it wasn’t just politics that dominated the chat—COVID-19 began to creep into conversations like an unwelcome guest. Aaron D led the charge, sharing alarming statistics and personal anecdotes about the pandemic. “I mean, you can’t trust a free app to do your trading for you, right?” he quipped, referencing the chaotic stock market response to the outbreak. There was plenty of banter about stocking up on supplies, with Randy joking about his “strategic” hoarding of rice since 2010. The group’s humor shone through as they navigated the rising tensions, with Bront cracking jokes about how he would “YEET” his parents' car into the Long Island Sound if he got enough likes.\n\nAmid this whirlwind of discussions, personal updates brought a refreshing twist. Michael Wee shared his excitement about starting a new job, while Jack Lonneman was gearing up for a golf season filled with new clubs and lessons. “I’m definitely gonna need those lessons after this,” he chuckled, referencing his past golf mishaps. Meanwhile, Nudey chimed in with tales from his baking class, which had him both excited and slightly apprehensive about how it would turn out.\n\nAs the week progressed, the group’s trademark humor persisted through the tension. They riffed off each other, creating a humorous narrative around the absurdity of their lives interspersed with serious global events. “I’m just waiting for the moment they cancel the Derby,” Hubert mused, triggering a flurry of responses about what would happen if horse racing was canceled—anarchy, chaos, and of course, meme-worthy material.\n\n### Character Spotlights:\n- **Bront**: The ever-analytical and humorous member, he kept the group grounded with his insights into political matters while making"
    },
    {
        "week_starting": "2020-03-30",
        "week_ending": "2020-04-05",
        "summary": "# Weekly Recap: March 30 - April 5, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Golfing Adventures**: Jack Lonneman returns to golfing, discussing experiences at his local course, albeit a public one which he humorously criticized as a \"shithole.\" \n- **Quarantine Life**: The group shared their experiences during quarantine, with a mix of humor and frustration about work-from-home situations.\n- **Personal Milestones**: Jack's family celebrates his grandpa’s 90th birthday, sparking discussions about safety and family interactions during COVID-19.\n- **Social Commentary**: The group had ongoing discussions about the COVID-19 pandemic's impact on various aspects of life, including employment and health.\n- **Inside Jokes**: Continuing jokes about inside group dynamics, including Jack's golf skills, Bront's online persona, and Hubert's \"gamer\" lifestyle.\n\n### Main Topics of Discussion:\n1. **Golfing**: Jack’s golfing experiences and the group's mixed feelings towards public courses.\n2. **Quarantine Activities**: The ups and downs of working from home and the mental strain it brings.\n3. **Family Dynamics**: Jack’s concerns about visiting family during quarantine and the implications of doing so.\n4. **Social Media and Celebrity Culture**: Discussions surrounding Caroline Calloway and the absurdity of influencer culture amid a pandemic.\n\n### Emotional States:\n- **Humor**: The group maintained a light-hearted banter, using humor to cope with stress.\n- **Frustration**: Some expressed frustration regarding quarantine regulations and job security.\n- **Reflective**: Moments of reflection on personal circumstances and the collective situation were shared.\n\n### Controversies:\n- **Golf Course Quality**: Jack’s remarks on public golf courses led to light-hearted debates about standards in golfing.\n- **Family Visits**: Disagreements on the safety of visiting elderly relatives during the pandemic surfaced, particularly regarding Jack's plans.\n\n### Personal Updates and Life Events:\n- **Jack**: Discussed his return to golf and the challenges of visiting family during the pandemic.\n- **Bront**: Shared updates on his gaming setup and expressed excitement about a new PC build.\n- **Randy**: Announced his brother's election to the town council, and shared thoughts on the effects of the pandemic on community dynamics.\n- **Hubert**: Mentioned his experiences with working from home and the challenges of managing work-life balance.\n\n### Best Line of the Week:\n\"Imagine being in wave 3.\" – A humorous take on the unfolding COVID-19 situation, highlighting the group's ability to find humor in even the gravest of circumstances.\n\n## Narrative Section\n\n### Week-by-Week Story Arc:\nThe week kicked off with Jack Lonneman recounting his most recent golfing escapade, which didn't quite go as planned. After expressing disappointment over the quality of a public course he had played on, the group jumped in with classic banter, poking fun at Jack's recent golf obsession. Hubert Cumberdale chimed in about his own golf experiences, and the jokes flowed as freely as the drinks during their respective social distancing routines.\n\nAs the week progressed, discussions turned to how everyone was coping with the ongoing quarantine. Most shared a mixture of humor and frustration about working from home, with Jake Kurtz lamenting about the lack of sports and the general absurdity of life during a pandemic. The group’s dynamic shone through as they exchanged memes, shared their thoughts on celebrity culture, and even pondered the future of social interactions in a world increasingly ruled by social distancing.\n\nA significant moment came when Jack revealed plans to visit his grandparents for a milestone birthday. This sparked a lively debate about the safety of such visits, reflecting the group's concern for family health while also wanting to celebrate important life events. Jack’s humorous take on the situation—joking about the potential for a “big C” (COVID) exposure—was both a laugh and a sigh of relief as they navigated the complexities of family dynamics during a pandemic.\n\nMeanwhile, Bront kept the mood light with updates about his gaming setup and a potential new girlfriend, while Randy boasted about his brother’s recent election to town council, a beacon of positivity amidst the chaos. As the week came to a close, the group had settled into a rhythm of shared experiences, ranging from cooking disasters to virtual drinking sessions. \n\n### Character Spotlights:\n- **Jack Lonneman**: The self-proclaimed golf aficionado, navigating the complexities of family visits and quarantine life with humor.\n- **Bront**: The tech-savvy gamer who balanced his online persona with life at home, excited about new PC builds and gaming.\n- **Randy**: The optimist in the group, sharing personal milestones and offering comic relief with his candid observations.\n- **Hubert Cumberdale**: The gamer and voice of reason, often bringing a grounded perspective to the group’s more chao"
    },
    {
        "week_starting": "2020-04-06",
        "week_ending": "2020-04-12",
        "summary": "### Weekly Recap: April 6 - April 12, 2020\n\n---\n\n#### Summary Section:\n\n**Key Highlights:**\n- The group engaged in lively discussions about various topics, including their experiences with quarantine, personal updates, and humorous anecdotes.\n- **Valuable Life Updates:** Multiple members, including Jack, shared academic successes and personal milestones.\n- **Inside Jokes:** The ongoing meme exchanges and inside jokes, particularly around drinking, golf, and personal quirks, created a lighthearted environment.\n  \n**Main Topics of Discussion:**\n- **Quarantine Life:** Members shared experiences with lockdown, including coping mechanisms, drinking habits, and cooking adventures.\n- **Golfing:** Numerous discussions revolved around golf, including Jack's experiences with his dad and the group's collective love for the sport.\n- **Personal Achievements:** Jack earned a 4.0 GPA, while Bront and others discussed their careers and educational paths, including the importance of further education and job security during the pandemic.\n  \n**Emotional States:**\n- The mood fluctuated between humorous banter and moments of deeper reflection on the impact of COVID-19, with some expressing anxiety over job security and the state of the world.\n- **Lightheartedness:** Frequent jokes about drinking, inside jokes about brands like BOAST, and playful banter helped maintain a positive atmosphere.\n\n**Controversies:**\n- The group had friendly debates about the seriousness of the COVID-19 pandemic and the varying responses from different states, particularly regarding economic recovery plans.\n\n**Personal Updates and Life Events:**\n- **Jack Lonneman** celebrated his academic success with a 4.0 GPA.\n- **Bront** discussed his newfound handyman skills after unclogging a sink.\n- **Dennis** shared tidbits about his quarantine cooking and the struggles of maintaining social interactions.\n  \n**Best Line of the Week:**\n- \"If you’re not drinking every night, it’s pretty cringe ngl.\" - Hubert Cumberdale\n\n---\n\n#### Narrative Section:\n\nWhat a week, huh? As we rolled through April 6 to April 12, the group was buzzing with energy, even if we were all stuck at home. With the pandemic still looming large, we relied on our trusty GroupMe to keep the spirits high and the laughs coming.\n\nJack kicked off the week with some seriously impressive academic news—he snagged a 4.0 GPA! Cue the confetti! Meanwhile, Bront shared his newfound handyman skills after he heroically unclogged a sink with nothing but some baking soda. “I’m basically a handyman now,” he declared, earning laughs and lighthearted jabs about his newfound prowess.\n\nThe conversations flowed like the tequila Aaron had hit hard—\"the tequila hit like a brick wall,\" he proclaimed, while others chimed in, unanimously agreeing that drinking alone wasn’t quite the vibe. “I can drink every night now!” Aaron mused, but it wasn’t long before the group was back on the drinking jokes, with Hubert claiming, “If you’re not drinking every night, it’s pretty cringe ngl.”\n\nGolf was a recurring theme of the week, with Jack sharing tales of a frustrating day on the course with his dad. “He’s mad that I lost balls that were in his bag,” he lamented. The group couldn't help but roast him for it. “If you let a beginner play with your clubs and balls and are surprised that said beginner has lost golf balls, idk what to say,” Aaron quipped, and the jokes just kept rolling.\n\nAs the week progressed, we shared insights about our quarantine experiences—some funny, some serious. Randy was stressed about his dog’s weight (“She’s only 55 lbs!”), while others pondered the state of their health and how they were coping with lockdown. “I just want to golf dang it!” Jack exclaimed, encapsulating the collective longing for normalcy.\n\nIn the midst of the chaos, personal milestones popped up. Tre Tellor turned 20, and the group celebrated with a virtual toast. “Happy birthday!!” echoed in the chat, and the banter about aging and responsibilities began.\n\nAmidst the humor and the memes, serious discussions also crept in. The group reflected on the impacts of the pandemic on jobs and personal lives, sharing worries about the future while maintaining a sense of camaraderie. “I’m hoping to kill myself before the virus does,” Aaron joked darkly, but it was all in good fun as we navigated this surreal time together.\n\nAs the week wrapped up with discussions about cooking mishaps, plans for upcoming birthdays, and the latest in golf gear, it was clear that our group had turned this quarantine into something manageable—one meme at a time. \n\nSo here we are, still going strong, still finding ways to laugh, and still making memories, albeit virtually. Until next week, keep those drinks flowing and those memes coming! Cheers! 🍻"
    },
    {
        "week_starting": "2020-04-27",
        "week_ending": "2020-05-03",
        "summary": "# Weekly Recap: April 27, 2020 - May 3, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Jack's Summer Job:** Jack Lonneman is gearing up for his summer job at Nantucket, with discussions about ferry bookings and golf attire.\n- **Nudey's Wing Experience:** Nudey shared a salty experience with overly salted wings, leading to a humorous exchange.\n- **Bront's Presentation Success:** Bront successfully presented a project and received praise from his professor, showcasing his growth.\n- **Tom's Job Hunt:** Tom is navigating the job application process, including sending his resume to his girlfriend's father.\n- **Randy's Cooking Adventures:** Randy attempted to make bread, leading to a funny mishap but ultimately salvaging the loaf.\n\n### Main Topics of Discussion:\n- **Summer Plans:** Jack discussed his upcoming job and the expected chill summer vibe at Nantucket.\n- **Food and Cooking:** Members shared their culinary adventures, including cooking mishaps and grilling plans.\n- **Job Applications:** Tom's interview process and the challenges of job hunting during a pandemic were hot topics.\n- **Golf Gear Recommendations:** Jack and Nudey exchanged tips on golf clubs for beginners, with Jack offering advice on suitable sets.\n- **Pop Culture:** The group chatted about various shows, including \"Rick and Morty,\" \"Succession,\" and the latest in gaming.\n\n### Emotional States:\n- **Humor and Lightheartedness:** The mood remained generally upbeat, filled with jokes about food, jobs, and personal anecdotes.\n- **Anxiety and Frustration:** Some members expressed anxiety about job markets and the pandemic's impact on their lives, particularly Tom.\n\n### Controversies:\n- **Job Market Discussions:** Some heated debates arose around the effectiveness of government measures and the job market.\n- **Political Commentary:** The group had light-hearted yet pointed discussions about political figures and decisions regarding COVID-19.\n\n### Personal Updates and Life Events:\n- **Jack's Job:** Jack is set to start a new job on Nantucket.\n- **Bront's Academic Success:** Bront received positive feedback on a presentation, marking a personal milestone.\n- **Randy's Cooking Mishap:** Randy's attempt at making bread ended in a humorous disaster but ultimately turned out fine.\n\n### Best Line of the Week:\n- “If I don’t get the job, I start doing anal.” - Jack Lonneman, adding a twist of humor to Tom's job application woes.\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc:\nAh, the week kicked off with Jack Lonneman buzzing about his upcoming summer job on Nantucket. He shared how he was advised not to pack too many golf clothes as they’d have everything sorted for him upon arrival. The excitement was infectious, especially when he recalled his first drunken adventures on the island. Meanwhile, Nudey chimed in with a hilarious recount of his experience with overly salted wings, turning a simple meal into a comical saga that had everyone in stitches.\n\nAs the week progressed, Bront found himself basking in the glory of a successful presentation. “Dr. Honggang liked the presentation so much that he’s going to look at the cache simulator design I wrote over the summer,” he proudly declared, earning a round of virtual high-fives. The group celebrated his accomplishments, with Tom encouraging him to crush it as usual.\n\nTom was deep in the job hunt grind, nervously preparing to send his resume to his girlfriend's father. The group rallied around him, offering sage advice and a good dose of humor to ease his anxiety. “Just email him like ‘Hey thanks for offering to help, here's my info,’” suggested Aaron D, while everyone else chimed in with various tips on how to navigate the tricky waters of nepotism.\n\nAmidst the job-related banter, Randy was on a culinary adventure of his own, trying his hand at making bread. “RIP my bread,” he lamented after a mishap, but the good-natured ribbing turned into laughter when he managed to salvage it. “F’s in the chat boys,” he joked, bringing the group together in shared humor.\n\nThe golf enthusiasts in the group had their moment as Jack and Nudey exchanged tips on golf clubs. Jack, ever the connoisseur, offered advice on sets for beginners, proving his expertise once again. “Just get a beginner set, take lessons, then get fitted for clubs,” he advised, while Nudey soaked in every bit of wisdom.\n\nAs the weekend rolled in, the conversations shifted to lighter topics, including everyone's favorite shows and the absurdity of life in quarantine. “Dude, do you ever just sit in your truck?” Jack questioned, leading to a hilarious exchange about the mundane quirks of quarantine life. \n\nBy the end of the week, the group was filled with a mix of excitement for the future and a touch of anxiety about the present. With Jack's job looming, Bront's academic success shining bright, and Tom navigating the job market, it was a week filled with ups, downs, and plenty of laughs.\n\n### Character Spotlights:\n- **Jack Lonneman:** The enthusi"
    },
    {
        "week_starting": "2020-05-11",
        "week_ending": "2020-05-17",
        "summary": "# Weekly Recap: May 11 - May 17, 2020\n\n## Summary Section\n\n### Key Highlights\n- **Alcohol Conversations:** Hubert Cumberdale and Aaron D discuss their dwindling alcohol supplies and the effects of isolation.\n- **Golf Course Updates:** Jack Lonneman shares the status of golf courses reopening, with humor about the absurdities of current regulations.\n- **Personal Milestones:** Several members update the group on personal challenges and victories, including running achievements and family events.\n- **Humor and Inside Jokes:** The group remains engaged in their usual banter, with inside jokes about random topics, including 'awkward' fashion choices and food preferences.\n- **Movie and TV Recommendations:** Discussions on movies like \"Goodfellas\" and shows like \"Ozark\" lead to debates about their quality.\n\n### Main Topics of Discussion\n1. **Alcohol Supply:** Hubert's struggle with alcohol shortages and Aaron's reflections on his previous excess.\n2. **Golf Course Regulations:** Jack navigating the reopening of golf courses amid COVID-19 regulations.\n3. **Running and Fitness:** Aaron, Hubert, and others share updates about their fitness journeys during lockdown.\n4. **Food and Cooking:** Discussions on recipes, including Hubert's cooking attempts and Randy's food recommendations.\n5. **Pop Culture:** Conversations about movies, TV shows, and shared interests, highlighting the group's eclectic tastes.\n\n### Emotional States\n- **Humor and Sarcasm:** The group maintained a light-hearted atmosphere, with plenty of jokes and playful sarcasm about current events.\n- **Reflection and Anxiety:** There were moments of reflection, particularly regarding job security and personal health.\n- **Supportive Vibes:** Members shared personal updates and offered each other support, especially regarding fitness and family.\n\n### Controversies\n- **Job Security Discussions:** A few members expressed frustration over employment uncertainty and the challenges of the job market amid the pandemic.\n- **TV Recommendations:** Disagreements arose over the quality of certain shows, like \"Ozark,\" which some found captivating while others were less impressed.\n\n### Personal Updates and Life Events\n- **Hubert's Cookbook:** Hubert received a family cookbook for Mother's Day, which sparked discussions about family recipes.\n- **Randy's Cooking Ventures:** Randy shared his love for biscuits and encouraged others to try cooking different dishes.\n- **Jake's Running Progress:** Jake reported improvement in his running technique, receiving praise from the group.\n\n### Best Line of the Week\n\"How do you do the initial treating of jeans? I didn’t know if I need to like soak 'em or some bullshit that people with jeans do.\" - Hubert Cumberdale\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc\nThis week was a rollercoaster of hilarity and heartfelt moments in our group chat. It kicked off with Hubert Cumberdale lamenting the lack of alcohol in his apartment, joking about the shakes while Aaron D teased him about his previous drinking habits. As they navigated their \"dry\" days, discussions turned to the absurdity of going from binge drinking to contemplating sobriety before their respective significant others returned.\n\nGolfing was another big topic of the week, with Jack Lonneman navigating the murky waters of reopening golf courses. His updates about the regulations were met with typical sarcasm from the group, and Hubert's quips about “groundskeeping” jobs made everyone chuckle. “What’s a golf course?” Bront mused, adding his own spin on the inside joke about urban golfing.\n\nMeanwhile, the fitness enthusiasts in the group were busy sharing their running updates. Aaron D was keen to squeeze in a run to beat the rain, while Jake proudly showcased his progress, receiving pats on the back for his dedication. The camaraderie was palpable as they cheered each other on, even if it involved some playful ribbing about their workout attire.\n\nFood was another frequent topic. Hubert’s attempts at making a “chili mac” dinner were met with mixed reviews, while Randy’s passion for biscuits had everyone drooling. The ongoing debate about breakfast sandwiches—particularly the merits of bagels versus hard rolls—sparked laughter and some serious culinary tips.\n\nAmid the light-hearted banter, deeper reflections emerged as well. Members discussed the pressures of job insecurity, with Tom sharing his frustrations about being unemployed during a pandemic. Still, the lightheartedness prevailed, with plenty of inside jokes that kept spirits high.\n\n### Character Spotlights\n- **Hubert Cumberdale:** The group’s resident chef, Hubert juggled cooking attempts with his usual humor, sharing his struggles with jeans and alcohol while trying to keep it light.\n- **Jack Lonneman:** A golf aficionado, Jack kept the group informed on the latest about golf course openings, all while maintaining his trademark sarcasm.\n- **Aaron D:** The voice of reason, Aaron offered comedic relief while navigating hi"
    },
    {
        "week_starting": "2020-05-18",
        "week_ending": "2020-05-24",
        "summary": "# Weekly Recap: May 18-24, 2020\n\n## Summary Section:\n\n### Key Highlights:\n- **Golf Discussion:** The group had a lot of banter about golf and its reopening, with Jack Lonneman eagerly waiting to return to work.\n- **Tre Tellor's Fundraising Success:** Tre raised $205 for his garden project, leading to plans for a garden party.\n- **Personal Milestones:** Several members shared updates about new jobs, personal projects, and life changes, including Nudey's new bike and Jack's impending job start.\n- **Inside Jokes:** There were numerous inside jokes about \"lesbian haircuts,\" the significance of golf, and the ongoing pandemic.\n- **Controversial Conversations:** The group dove into deeper discussions about race, reparations, and even joked about political issues.\n\n### Main Topics of Discussion:\n1. **Golf:** The group discussed the opening of golf courses, with plenty of humor about Jack's upcoming job.\n2. **Personal Finance and Fundraising:** Tre’s crowdfunding for his garden project sparked a lighthearted discussion on financial contributions and reparations.\n3. **Pandemic Effects:** Conversations about the ongoing effects of COVID-19, including feelings of frustration and humor about staying indoors.\n4. **Video Games and Movies:** The group shared thoughts on games like “The Division 2” and movies they were watching during the quarantine.\n\n### Emotional States:\n- **Humor and Sarcasm:** The mood was predominantly light-hearted, with plenty of sarcastic jokes and inside references.\n- **Frustration:** Some members expressed frustration about restrictions due to the pandemic and job-related issues.\n- **Excitement:** There was a sense of anticipation for upcoming events, including the reopening of golf and personal projects.\n\n### Controversies:\n- **Debates on Reparations:** The group engaged in a heated but humorous discussion about reparations, touching on sensitive topics with sarcasm and wit.\n- **Political Commentary:** Jokes about politicians and their decisions led to some edgy humor, particularly regarding COVID-19 management.\n\n### Personal Updates and Life Events:\n- **Tre Tellor:** Successfully raised $205 for his garden project via crowdfunding.\n- **Nudey:** Bought a new Trek bike, showcasing a commitment to cycling.\n- **Jack Lonneman:** Preparing to start a job on June 1 after a quarantine period.\n- **Hubert Cumberdale:** Shared excitement about upcoming video games and personal projects.\n\n### Best Line of the Week:\n\"Damn it, we’ve tried everything to get this kid covid... how about we have him go meet random strangers, maybe that’ll work.\" – Aaron D.\n\n---\n\n## Narrative Section:\n\nAh, what a week it’s been! From baby ducks to deep existential discussions, it was a rollercoaster for our group. Kicking off the week on May 18, the chat was buzzing with excitement over the news that golf was finally reopening. Jack Lonneman was particularly eager, practically bouncing in his seat at the thought of getting back to work. “All I need is the 14-day self-quarantine lifted,” he lamented, while Aaron D. chimed in, “Bro, that’s a free vacation!”\n\nMeanwhile, Tre Tellor was basking in the glow of success after raising $205 for his garden project. “I feel like I have to throw a garden party now,” he exclaimed, a sentiment that was met with a chorus of encouragement and a few cheeky jokes about “white guilt” reparations.\n\nAs the week unfolded, our conversations took a turn into the realms of personal finance and reparations. With Hubert Cumberdale jokingly claiming he deserved reparations for his lavish lifestyle (“I have literally asked for reparations on Juneteenth and gotten some money lol”), the banter took a hilariously absurd turn. Jake Kurtz added to the mix, “I need reparations for enchiladas!” The back-and-forth was light-hearted yet pointed, revealing the group's dynamic blend of humor and seriousness.\n\nAs the group kept the laughs rolling, the discussions also ventured into the frustrations of quarantine life. “Does the 25% rule still apply?” Aaron asked as everyone speculated on what life would look like post-lockdown. It was a blend of hope and anxiety, with members sharing their feelings about the current state of the world. “Imagine not being open yet,” Bront quipped, referencing other states that seemed to be moving forward faster than theirs.\n\nNudey took a moment to drop some exciting news: he had snagged a Trek bike! “It’s a bit small, but I think it’s the right size,” he shared, adding to the excitement of the week. And Jack couldn't resist the opportunity to quip back, “Welcome to the Trek gang!”\n\nAs the weekend approached, the group was in high spirits, anticipating the long holiday weekend. Conversations about movies, video games, and beer flowed freely, with Nudey leading a mini-rant about needing a new desk. \"I’m going to get a drill out and see if I can make a slot that will work,\" he said, showcasing his DIY spirit. Meanwhile, Hubert was busy collecting gear for his own endeavors, sharing links that"
    },
    {
        "week_starting": "2020-05-25",
        "week_ending": "2020-05-31",
        "summary": "# Weekly Recap: May 25 - May 31, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Memorial Day Celebrations:** Members shared their weekend plans, including BBQs and family gatherings.\n- **Graduation Milestone:** Jay announced his college graduation, receiving love and support from the group.\n- **Dramatic Events:** The week was marked by discussions on the escalating protests and riots across the country, especially related to police violence.\n- **Comedic Moments:** A plethora of inside jokes and memes circulated, keeping the mood light despite serious discussions.\n- **Food Talk:** Hubert made fried chicken, prompting a flurry of food-related banter.\n\n### Main Topics of Discussion:\n1. **Graduations and Life Updates:** Jay shared his graduation news and job hunting efforts.\n2. **Current Events:** The group discussed the protests sparked by George Floyd's death, with varying opinions on police actions and societal issues.\n3. **Food and Cooking:** Hubert's fried chicken was a hit, along with discussions about recipes and dining options.\n4. **Inside Jokes and Memes:** The group continued to share humorous content, often referencing previous chats and experiences.\n\n### Emotional States:\n- **Supportive:** The group was largely supportive, especially towards Jay's graduation and the serious discussions regarding protests.\n- **Humorous:** Despite serious topics, the humor was rampant, with jokes about food, past experiences, and light-hearted banter about personal lives.\n- **Reflective:** Some members reflected on the current societal climate and their personal feelings regarding the protests and riots.\n\n### Controversies:\n- **Police Violence:** Heated discussions emerged regarding the actions of police during the protests, with some advocating for significant reforms.\n- **Social Media Reactions:** Members debated the impact of social media on public perception and actions taken during the protests.\n\n### Personal Updates and Life Events:\n- **Jay's Graduation:** Celebrated his college graduation and shared his job interview experiences.\n- **Tre's Activism:** Tre recounted experiences from the protests, including aiding injured demonstrators.\n\n### Best Line of the Week:\n“Imagine waiting 10 months then you have to resubmit a 140-page document of personal facts.” - Hubert Cumberdale\n\n---\n\n## Narrative Section\n\nThis week in our beloved group chat was a rollercoaster of emotions, memes, and the occasional existential crisis. It kicked off with the typical Memorial Day chatter. \"Happy Memorial Day y’all!\" shouted House Mom, and soon enough, the group was flooded with plans for BBQs and family gatherings. Randy was all about the food, of course, asking, \"Blueberry Cobbler check?\" because what’s a holiday without dessert?\n\nJay stole the spotlight by announcing his graduation. \"I graduated college a couple of weeks ago,\" he confessed, prompting everyone to reminisce about the good ol’ high school days. \"Congrats Jay!\" echoed through the chat, showcasing the true camaraderie in our little circle. Hubert, being the jokester he is, quipped, \"You should crash a BMW in celebration,\" which had everyone rolling.\n\nHowever, amidst the celebrations, the mood shifted dramatically as discussions turned toward the ongoing protests across the country. The chat lit up with serious conversations about police brutality, with Tre sharing firsthand experiences from the protests. \"We tried to patch some up,\" he noted, detailing how he helped injured protestors. \"They shot rubber and gas and flashbangs at the protestor's a block away at the precinct,\" he recounted, his tone mixing disbelief with concern. \n\nAmidst the chaos in the world, our humor remained intact. Hubert's fried chicken adventure was a highlight, leading to a flurry of food talk. \"I'm makin’ mashed taters, and green beans,\" he declared, while Nudey chimed in, \"We eating guuud.\" The food discussions were peppered with inside jokes, including Hubert’s infamous “Hubert special” of frozen pizza. \n\nAs the week went on, the memes kept rolling in. Jack shared a hilarious video of a \"wheelchair lady\" causing chaos, leading to a barrage of jokes about the absurdity of the situation. \"Things you never thought you’d watch live,\" he remarked, showcasing our group's ability to find humor even in the most unexpected places.\n\nBy the end of the week, the group was buzzing with anticipation for the weekend. Discussions flowed into plans for ice cream runs and late-night Mario games at Hubert’s place, with everyone eager to unwind after a week filled with serious topics and laughter. \n\nAs we wrapped up the week, it was clear that our group chat was more than just a digital space. It was a community where we supported each other through life’s milestones, found humor in the mundane, and engaged in meaningful discussions about the world around us. \n\nHere’s to another week of inside jokes, heartfelt moments, and the occasional meme that brings us all back together."
    },
    {
        "week_starting": "2020-06-08",
        "week_ending": "2020-06-14",
        "summary": "# Weekly Recap: June 8 - June 14, 2020\n\n## Summary Section\n\n### Key Highlights:\n- Jack Lonneman debated reaching out to his ex, Maddy, after reflecting on their breakup.\n- Bront received a response from Microsoft about a speaking opportunity, marking a personal milestone.\n- The group discussed various topics including golf shoes, game consoles, and the latest Netflix specials.\n\n### Main Topics of Discussion:\n1. **Jack's Relationship Reflections**: Jack opened up about his feelings post-breakup and whether he should reach out to Maddy.\n2. **Bront's Career Update**: Excitement around a meeting with Microsoft and the potential it brings for his career.\n3. **Gaming and Consoles**: Discussions around the PS5 event, new game releases, and nostalgic gaming experiences.\n4. **Food and Cooking**: Various mentions of food, including Nudey's adventures with rosé and brunch.\n\n### Emotional States:\n- The group experienced a range of emotions: humor, nostalgia, introspection, and light-hearted banter.\n- Jack's struggle with his breakup brought a more serious tone, contrasting with the group's usual comedic exchanges.\n\n### Controversies:\n- Jack's desire to reconnect with Maddy led to a heated debate about relationships and whether it's worth trying to revive them.\n- Some playful arguments about the merits of different gaming consoles and food choices.\n\n### Personal Updates and Life Events:\n- **Bront**: Received a response about a speaking engagement with Microsoft, a significant career milestone.\n- **Jack**: Contemplated his past relationship with Maddy and whether to reach out.\n- **Nudey**: Went hiking and visited wineries, enjoying a day out.\n\n### Best Line of the Week:\n\"Is there anything else that comes close to a good burrito? No, no there is not.\" – Jack Lonneman\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc\nAh, what a week it was! It all kicked off on a classic Monday when Jack Lonneman started the week with a dose of introspection, pondering whether to reach out to his ex, Maddy. His existential musings provided the perfect backdrop for the group, who playfully poked at his predicament. “You sound like a bitch tho,” Jake Kurtz quipped, making sure Jack didn’t take himself too seriously amid the emotional turmoil. While Jack wrestled with his feelings, the rest of the crew was busy discussing their plans for the summer.\n\nBront had some exciting news of his own, as he received a response from Microsoft regarding a speaking opportunity. “This is like a highlight of my career so far,” he shared, and the group cheered him on. The rest of the week saw Bront basking in the glow of potential career advancements, with everyone rallying around him.\n\nAs the week progressed, the discussions turned to lighter topics, like Jack’s recent foray into golf. “Someone needs to make loafers with golf spikes,” he joked, showcasing the quintessential blend of humor and casual banter that defines this group. The chat was peppered with inside jokes and references, from Randy’s obsession with golf shoes to Aaron's sarcastic comments about wearing masks.\n\nNudey, on the other hand, was living his best life, hiking and indulging in wine tastings. He reported back with tales of his day, “I hiked, hit two wineries, and have a pizza waiting for me at home.” The group quickly pivoted to culinary discussions, reminiscing about their favorite foods and planning future brunches. Jake even chimed in with a nod to his culinary prowess, stating, \"It is Mexican night my dudes,\" which elicited a round of cheers and playful banter.\n\nAs the week drew to a close, Jack’s reflections on his breakup led to deep discussions about relationships, attachment, and the complexities of love. It was both a serious and humorous moment as the group weighed in with their opinions—most of them leaning toward the “don’t go back” side of things. Jack, however, remained contemplative, leading to some poignant moments amid the usual chuckles.\n\n### Character Spotlights\n- **Jack Lonneman**: The introspective soul of the group this week, grappling with the emotional remnants of his breakup while still managing to keep the humor alive.\n- **Bront**: The ambitious go-getter, celebrating a career milestone and sharing his excitement with the group, making them all cheer for him.\n- **Nudey**: The adventurous spirit, enjoying hiking and wine, often bringing a casual, fun vibe to the chat.\n- **Jake Kurtz**: The jokester, always ready with a snappy comment or a funny meme to lighten the mood, even when the discussions turn serious.\n\n### Humorous Moments\nThe humor this week was never in short supply. From Aaron’s quip about Jack's relationship struggles to Randy's playful jabs about the absurdity of life, the group’s dynamic shone brightly. The inside jokes about golf shoes, burritos, and even the trials of finding the perfect gaming setup kept everyone laughing. And who could forget the moment when Jack was recounted as “the guy who’s just happy to see you back on track,” a perfe"
    },
    {
        "week_starting": "2020-06-15",
        "week_ending": "2020-06-21",
        "summary": "# Weekly Recap: June 15 - June 21, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **JD's New Roommate**: Aaron D announces he will be moving in with JD.\n- **Jack's Job Update**: Jack Lonneman starts his new job at the golf pro shop.\n- **Life Events**: Various discussions about personal milestones, including Nudey considering getting a second cat.\n- **Food Adventures**: Multiple discussions about food, including BBQ and new restaurant experiences.\n- **Inside Jokes**: Recurring jokes about “ACK” and the group's humorous takes on serious topics.\n\n### Main Topics of Discussion:\n1. **Job Changes**: Jack starting his new job at the pro shop led to discussions about summer gigs and income.\n2. **Current Events**: Conversations about protests, COVID-19, and related social issues, including debates about the significance of Juneteenth.\n3. **Personal Lives**: Updates on relationships, including Tom's surgery and newfound freedom, and Nudey's dinner plans.\n4. **Food & Drinks**: Excitement over meals, including BBQ styles, and plans for dining out.\n\n### Emotional States:\n- **Humor**: The group maintained a lighthearted tone filled with jokes and memes, especially around personal updates and food.\n- **Anxiety**: Some moments of anxiety regarding current events, particularly regarding COVID-19 and personal health.\n- **Excitement**: Several members expressed excitement about new jobs, food adventures, and upcoming plans.\n\n### Controversies:\n- **Political Discussions**: Heated debates about the protests and differing views on the significance of historical figures and statues.\n- **Quarantine Fatigue**: Discussions about the ongoing pandemic led to differing opinions on how to cope and what the future holds.\n\n### Personal Updates and Life Events:\n- **Jack Lonneman**: Started a new job at the golf pro shop.\n- **Tom**: Underwent tonsil surgery and shared humorous post-surgery experiences.\n- **Nudey**: Considering adopting a second cat and shared experiences about new dining spots.\n\n### Best Line of the Week:\n“@Tre Tellor, you know you have the right white friends when they start sending you reparations money on Juneteenth.” – Tre Tellor\n\n---\n\n## Narrative Section\n\nAh, what a week it has been for our group! It kicked off with Aaron D announcing his big move in with JD, which set off a flurry of jokes about band names like \"JD and the Ivy Style Review.\" Meanwhile, Jack Lonneman celebrated his first day at the pro shop, which is basically like winning the lottery for him—free access to the golf course and all the Pro V1s he can handle! Naturally, this led to a hilarious debate about “who else makes less money than me in here?” as income comparisons became the inside joke of the week.\n\nAs the week progressed, the group took a deep dive into current events, particularly surrounding Juneteenth. There was a mix of humor and serious reflection, with everyone weighing in on the significance of the day—though some of the jokes went a little too far into the edge of taste, prompting a few tense moments. Classic groupme antics!\n\nFood was a recurring theme, with all the boys buzzing about their culinary adventures, especially BBQ. Randy, our resident BBQ expert, explained the intricacies of North Carolina BBQ, igniting a delicious debate about the best ways to prepare it. Everyone was drooling over the prospect of slow-cooked pulled pork while Jake Kurtz eagerly awaited his home inspection, dreaming of backyard BBQs to come.\n\nMeanwhile, Nudey was on a quest for the best local eats, particularly eyeing a hot chicken place. His excitement was palpable as he shared plans to check it out, and we all eagerly awaited his review. In the spirit of culinary exploration, the group also reminisced over past food adventures, leading to the classic line about how \"ACK is OPEN!\" echoing through the chat, a nod to their favorite local spot.\n\nTom, recovering from his tonsil surgery, brought a wave of sympathy and humor when he shared his post-op experiences. His painkiller-induced musings led to some memorable quotes, and the group couldn't help but poke fun at his newfound “high” state. The comedic camaraderie was on full display as they rallied around him, sharing their own stories of past surgeries and pain management.\n\nAs the weekend approached, plans for gatherings and food adventures were set in motion. Nudey invited Hubert and others over for a grilling session, which quickly morphed into a meme-worthy conversation about what to bring and whether or not “we can still say the N-word.” The energy was contagious as the group prepped for a fun-filled weekend, with promises of good food and even better company.\n\nFrom inside jokes about “the Chad bar” to heated debates over the political significance of historical events, this week was a whirlwind of laughter, friendship, and a bit of introspection. As we all know, it wouldn’t be a typical group chat without a healthy dose of banter and some spicy food discussions. So, here’s to another week of chaos an"
    },
    {
        "week_starting": "2020-06-29",
        "week_ending": "2020-07-05",
        "summary": "# Weekly Recap (June 29 - July 5, 2020)\n\n## Summary Section\n\n### Key Highlights\n- **Discussions on Graduation**: Plans for Jack's Zoom graduation and celebrations.\n- **COVID-19 Impact**: Ongoing conversations about work and life adjustments due to the pandemic.\n- **Golf Adventures**: Discussions about golf outings and Jack’s new job at the golf course.\n- **July 4th Celebrations**: Plans and reflections on fireworks, grilling, and the upcoming holiday.\n- **Kanye for President**: Light-hearted debates about Kanye West’s presidential aspirations.\n- **Memes and Jokes**: A plethora of memes shared, especially involving Guy Fieri and inside jokes about the group.\n\n### Main Topics of Discussion\n- **College Football**: Debates about the future of college football amidst the pandemic.\n- **Work Updates**: Members shared personal career updates and challenges.\n- **4th of July Plans**: Excitement around holiday plans and general summer activities.\n- **Karts and Racing**: Juulio’s adventures in karting sparked interest among the group.\n- **Media Consumption**: Conversations about shows and movies, including Avatar and Hamilton.\n\n### Emotional States\n- **Humor and Sarcasm**: Consistent joking and playful banter throughout the week.\n- **Anxiety**: Underlying concerns about job stability and the pandemic.\n- **Excitement**: Anticipation for July 4th celebrations and personal milestones.\n\n### Controversies\n- **Opinions on Hamilton**: Mixed reviews on the musical and its historical accuracy.\n- **Political Discussions**: Light debates about Kanye West’s candidacy and its implications.\n\n### Personal Updates and Life Events\n- **Jake’s Home Loan Approval**: Excitement around Jake getting approved for a home loan.\n- **Juulio’s Birthday**: Celebrations for Juulio's birthday throughout the week.\n- **Jack's New Job**: Updates about Jack's experiences working at the golf course.\n\n### Best Line of the Week\n\"Imagine not driving a car with a massive coolant leak that you have to pool over and wait for it to cool off every 5 miles because you forgot to fill up your milk jug full of water.\" - Randy\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc\nThis week started off with a mix of nostalgia for college days and the anxiety of upcoming graduations. Jack was gearing up for his Zoom graduation, and the group had a good laugh about how many of them would attend virtually, as Randy quipped about not logging on if it was on Zoom. Amidst the banter about college football being a no-show this season, Jack held firm that the Gamecocks would win it all, a sentiment met with both skepticism and laughter.\n\nAs the week progressed, the conversations shifted towards work-life adjustments due to COVID-19. House Mom expressed their frustration about work-related issues, and the group chimed in with their own work woes, finding humor in shared experiences. Randy's quip about keeping your head down for 40 years to enjoy life resonated deeply, sparking a wave of reflective humor as they shared their career aspirations and fears.\n\nThe excitement for the 4th of July was palpable. Plans for grilling and fireworks dominated the discussions. Nudey expressed concern about the noise from fireworks affecting his pets, while the rest of the group made plans for fun and festivities. Hubert and Nudey even set plans to hit the range early, showcasing their eagerness to make the most of the long weekend.\n\nJuulio shared his exhilarating karting adventures, detailing the high-speed thrills and a spectacular wreck that had everyone on the edge of their seats. His enthusiasm was infectious, and soon everyone was talking about their own racing experiences, with Jack jokingly offering to join in for a race.\n\nAs the holiday approached, the group’s humor took a more political turn with the mention of Kanye West’s presidential run. The memes flew, and the inside jokes about Guy Fieri continued to flow, creating a light-hearted atmosphere amidst serious topics. The banter reached a peak as they chatted about Hamilton, with Jake voicing his less-than-enthusiastic opinion, leading to spirited debates about the accuracy of historical portrayals in popular culture.\n\n### Character Spotlights\n- **Randy**: The group's comedian, always ready with a quip that leaves everyone in stitches. He shared hilarious anecdotes about his family and work life, making him the unofficial morale booster.\n- **Jack**: Juggling his new job and graduation plans, Jack was the voice of optimism about college football and was always up for a laugh about his future.\n- **Juulio**: The thrill-seeker of the group, his karting stories kept everyone entertained, and his birthday celebrations were a highlight.\n- **Hubert**: The planner, always ready to set up meetups and activities, Hubert kept the group organized for their range day, ensuring everyone had a good time.\n- **Nudey**: The laid-back member who brought humor and insight into their plans, and was always up for grilling and chilling with the crew.\n\n###"
    },
    {
        "week_starting": "2020-07-06",
        "week_ending": "2020-07-12",
        "summary": "# Weekly Recap: July 6 - July 12, 2020\n\n## Summary Section:\n\n### Key Highlights:\n- **NASCAR Night:** The group discussed their plans to watch a NASCAR race, with Jake mentioning it was on \"X Games mode.\"\n- **Honeymoon Destination Poll:** A humorous poll about potential honeymoon spots led to a lively debate, with Jackson Hole and Nantucket being popular picks.\n- **Car Troubles and Fixes:** Jack shared a saga about getting his car fixed, which ended up being a comedic disaster.\n- **Jack’s Birthday Drama:** Jack's birthday plans got derailed due to a housemate's COVID-19 diagnosis, causing tension and uncertainty.\n- **New Additions to the Group:** Randy added Jack back to the group, sparking conversations about new and old inside jokes.\n\n### Main Topics of Discussion:\n- **Golfing and Sports:** The group had multiple conversations about golf, including hybrid clubs and upcoming golf trips, with Hubert planning a trip to the shooting range.\n- **College and COVID:** They discussed various universities’ plans for the fall semester amidst the pandemic, including hybrid models and online classes.\n- **Pop Culture and Media:** Conversations revolved around movies like \"Parasite,\" the \"Hamilton\" musical, and various memes circulating in their chat.\n\n### Emotional States:\n- The mood fluctuated between light-hearted and serious, with moments of humor (Jack’s car saga) and frustration (COVID-19 impacts on plans).\n- A sense of camaraderie was evident as members shared personal updates and jokes, providing laughter amid the challenges.\n\n### Controversies:\n- Disagreements arose regarding the best honeymoon destinations and the handling of COVID-19 by universities.\n- Jack faced scrutiny for potential noise complaints, leading to a funny but tense moment about being the “boring” one in his house.\n\n### Personal Updates and Life Events:\n- **Jack’s Birthday:** Plans were disrupted after a housemate caught COVID.\n- **Juulio's Karting Challenge:** Juulio discussed his struggle with weight classes in karting, causing a mix of humor and sympathy from the group.\n- **Hubert's New Gun:** Hubert revealed he acquired a new gun, prompting playful banter about home defense.\n\n### Best Line of the Week:\n“Imagine buying a house during a recession with the most uncertain job market since ’08.” - Jack, encapsulating the group's mix of humor and reality.\n\n---\n\n## Narrative Section:\n\nThis week in the chat was a rollercoaster of emotions and antics, starting off on a high note with the excitement of NASCAR racing. Jake was ready to watch the race \"on X Games mode,\" which sparked a few laughs and playful banter about how many snacks were necessary for such an event. The group's love for racing was clear, and it set the tone for a week filled with shared interests and humor.\n\nAs the week progressed, the group turned their attention to a light-hearted poll about honeymoon destinations. The options ranged from Jackson Hole to a classic Nantucket getaway, leading to some cheeky debates about who would actually want to ski in the summer. Jack Lonneman chimed in with his trademark wit, suggesting that if they didn't ski, why was Jackson Hole even on the list? The discussion was punctuated by Randy’s classic line about how \"NC is full,\" which had everyone rolling.\n\nIn the midst of the fun, Jack shared his latest car troubles. After waiting for a repair, he humorously lamented, “I just want to drive for God's sake!” The car saga quickly became a meme in the chat, with everyone eagerly awaiting updates on whether he could finally reclaim his wheels.\n\nHowever, the mood took a serious turn when Jack announced that his birthday plans were essentially canceled because a housemate had tested positive for COVID-19. “I can’t wait for the repair to be botched and the car to be broken again,” Jack quipped, but the reality of the situation weighed heavy on him. The group rallied around him, sharing their own stories of disrupted plans and offering humorous distractions.\n\nThroughout the week, the conversation seamlessly flowed from golf to pop culture. Hubert was particularly animated about his new gun acquisition, joking about home defense while the group chimed in with their own thoughts on firearms. Juulio took a moment to discuss his karting league and the weight class struggle, prompting a mix of sympathy and laughter from the group.\n\nAs the week wrapped up, the ongoing saga of Jack's housemates continued to provide entertainment. With reports of a noise complaint and the potential for HR drama, the group could hardly contain their amusement. “I just got bailed out,” Jack said, sharing the tension of the moment, and the group erupted in laughter.\n\nBy the end of the week, the group had solidified their bond through humor, shared frustrations, and a sprinkle of drama, proving once again that even amidst uncertainty, their friendship could weather any storm. Whether discussing the latest memes or navigating the complexities of adulthood, they were there for each oth"
    },
    {
        "week_starting": "2020-07-13",
        "week_ending": "2020-07-19",
        "summary": "# Weekly Recap: July 13 - July 19, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Bront's Project Anxiety**: Bront shared his struggles with project management, leading to a mix of support and jokes from the group.\n- **Hubert's Delivery Drama**: Hubert's package delivery saga turned into a comedic story of early morning calls and missed deliveries.\n- **Golf Talk**: The group discussed various golf topics, including upcoming tee times and gear, with Jack boasting about a demo day.\n- **Personal Milestones**: Brums announced a new job offer, bringing excitement and celebration into the group.\n- **Food and Cooking**: The conversation flowed into favorite foods, with several members sharing their cooking experiences.\n\n### Main Topics of Discussion:\n1. **Movies and Shows**: The group debated the merits of various films and TV shows, including \"Palm Springs\" and \"Atlanta.\"\n2. **Golf**: There was a lot of chatter about golf gear, upcoming tournaments, and personal golf stories.\n3. **Personal Experiences**: Members shared their personal anecdotes from work, relationships, and life milestones, with plenty of humor.\n\n### Emotional States:\n- **Humor and Banter**: The group maintained a light-hearted and humorous tone throughout the week.\n- **Anxiety and Reflection**: Bront expressed anxiety about his work project, prompting supportive responses from others.\n- **Excitement**: Brums's job offer brought a wave of positivity and congratulations from the group.\n\n### Controversies:\n- **Mask Wearing Discussion**: Conversations about mask-wearing led to humorous disagreements about when and where masks should be used.\n- **Golf Equipment Pricing**: Some members were outraged at the high costs of golf clubs, sparking a lively debate.\n\n### Personal Updates and Life Events:\n- **Brums's New Job**: Brums announced he got a new job with a starting salary of 36k plus bonuses, which was celebrated by the group.\n- **Randy's Golfing Success**: Randy shared his golfing achievements, making the most of his time on the course.\n\n### Best Line of the Week:\n“Bront crawled so the NYC tiger could run.” - A humorous reference to Bront's struggles amidst the group's ongoing banter.\n\n---\n\n## Narrative Section\n\nWhat a week it's been for our crew! Starting off on a high note, Bront kicked things off with his classic blend of humor and anxiety over a work project. He was feeling burnt out after a colleague suggested he abandon a month's worth of work for a new approach. The group rallied around him, offering support and sharing their own work-related struggles, proving yet again that our camaraderie thrives even in the toughest times.\n\nHubert shared a hilarious tale about a delivery gone wrong when Amazon decided to call him at 5 AM to deliver a package. The absurdity of the situation led to a flurry of jokes about delivery drivers and their questionable decision-making skills. “What delivery guy thought I’d be waiting at 5 AM for a six-dollar package?” he lamented. The story had us all rolling, showcasing our knack for finding humor in the mundane.\n\nIn between all this, the talk turned to golf. Jack was buzzing about a demo day where he scored some free swag while lamenting the exorbitant prices of golf gear. “$650 for a head? What’s next, a $2000 driver?” he joked, to which Randy quipped about stealing some Titleist gear. The golf banter was lively, with everyone sharing their personal bests and goals for the upcoming season.\n\nOf course, Brums made waves with his big announcement: he landed a new job! The excitement was palpable as everyone congratulated him on the new gig and the perks that came with it. “36k plus bonuses!” he boasted, and the group erupted in cheers, reminding us all that good news is best when shared.\n\nAs the week wrapped up, the culinary discussions took over. There were tales of cooking adventures, with Tom sharing his latest culinary creations that had his roommate drooling. “I was making Samin Nosrat’s buttermilk roast chicken,” he said, as we all dreamed of crispy skin and savory glory. \n\nAnd let's not forget the ongoing saga of COVID and its impact on our lives. Discussions about mask-wearing led to some classic inside jokes, with Aaron chiming in, “You’re all wearing masks alone in your cars, aren’t you?” The group burst into laughter, showcasing the absurdity of our new normal.\n\nAs we moved into the weekend, plans for dinner and get-togethers bubbled to the surface. “Let’s hit Old Town for some grub!” Hubert proposed, and the group jumped at the chance to socialize in person again, albeit cautiously.\n\nBy the end of the week, it was clear that while the world outside might be chaotic, our little group chat remained a sanctuary of laughter, support, and camaraderie. Here’s to another week of absurdity, inside jokes, and the joy of sharing life’s ups and downs together!"
    },
    {
        "week_starting": "2020-08-03",
        "week_ending": "2020-08-09",
        "summary": "# Weekly Recap: August 3 - August 9, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Home Ownership Conversations**: The group had extensive discussions about home buying, mortgages, and the implications of moving to different states, particularly Texas.\n- **Life Updates**: Exciting personal news was shared, including a pregnancy announcement from House Mom, and a potential move for Bront.\n- **Inside Jokes**: Several recurring jokes emerged, including references to \"Bermuda grass,\" \"big chungus,\" and the humorous interactions regarding ring sizes and engagements.\n- **Political Discussions**: The group engaged in light-hearted banter about political compass tests, COVID-19, and various social issues.\n  \n### Main Topics of Discussion:\n1. **Home Ownership**: The conversation about homes and mortgages dominated, especially for Bront and Jake Kurtz, as they weighed moving options and property values.\n2. **Personal Milestones**: House Mom announced her pregnancy, sparking celebratory messages and discussions about baby names.\n3. **Pop Culture**: There was a mix of discussions about movies, including “Palm Springs,” and the latest trends in music and TV shows.\n\n### Emotional States:\n- The week was filled with humor and light-hearted teasing, despite some underlying anxieties about the state of the world and personal lives. There were moments of genuine excitement with House Mom's announcement and camaraderie in discussions about potential moves.\n\n### Controversies:\n- Some playful disagreements arose over political views and home buying strategies, with members poking fun at each other's choices and opinions on living conditions.\n  \n### Personal Updates and Life Events:\n- **House Mom**: Announced she is pregnant and shared potential baby names, causing a stir of excitement in the group.\n- **Bront**: Discussed contemplating a move to Texas and shared concerns about home ownership and job security.\n- **Jake Kurtz**: Mentioned hosting a dinner with many people, highlighting the balancing act of socializing during the pandemic.\n\n### Best Line of the Week:\n- “If you’ll excuse me, I’m going to chip a few golf balls on this mfffff” – Jake Kurtz, reflecting the group's blend of humor and everyday life.\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc\nAs the week kicked off, the group found themselves deep in discussions about the merits of home ownership, with Bront contemplating a potential move to Texas. The banter flowed like the Bermuda grass jokes that Jake Kurtz threw around, as he explained the nuances of lawn care to Bront, who was only half-listening while trying to figure out if he could afford a down payment on a house. The absurdity of their discussions, particularly the idea of someone explaining Bermuda grass to a random stranger in 2019, sparked laughter that carried through the week.\n\nIn the midst of the housing talk, House Mom dropped her bombshell: she was pregnant! The news sent ripples through the chat, eliciting a flurry of congratulatory messages and playful banter about names. “Randolph Wilson Walker III” was pitched as a potential name by Randy, who was clearly excited about starting a lineage of “Randolphs.” The group rallied around her, sharing their best wishes and speculating on the future of this new trad baby.\n\nIn between the personal milestones, the group continued to engage in their usual humor-filled ride through the complexities of life. They bantered about everything from the absurdities of political statements to the latest Netflix releases like “Palm Springs.” Jake Kurtz, with his dry humor, recounted his plans for a dinner party with social distancing measures, while the rest of the crew poked fun at how they were all navigating the social scene amidst COVID-19.\n\nAs the week wound down, discussions turned philosophical as they pondered the nature of their political orientations, all while keeping it light with memes and inside jokes. The political compass tests prompted laughter as they realized how similar they had all become after years of chatting together. “Turns out 14 people talking every day for ten years make them think the same,” quipped one member, summing up their shared experience.\n\nIn a particularly humorous turn, Jack Lonneman shared a story of getting pulled over, which turned into a heartwarming encounter with the officer, showcasing the lighter side of life amidst the chaos of the world. “So no ticket, I figured being a Bengals fan was enough punishment,” he recounted, making everyone chuckle at the absurdity.\n\n### Character Spotlights\n- **House Mom**: The week’s shining star with her pregnancy announcement, she kept the group engaged with her enthusiasm and maternal instincts.\n- **Bront**: The resident planner, weighing moving options and contemplating future job prospects, all while keeping the group's spirits high with his humor.\n- **Jake Kurtz**: The ever-enthusiastic host, balancing life with humor and a dash of sarcasm, especially when discussing his dinn"
    },
    {
        "week_starting": "2020-08-17",
        "week_ending": "2020-08-23",
        "summary": "# Weekly Recap: August 17 - August 23, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Debates on Companies and Stocks:** Discussions about Nikola Motors and other tech companies, including their IPOs and questionable products.\n- **Gaming and VR Adventures:** Hubert and Nudey shared their VR experiences, with Beat Saber becoming a favorite workout.\n- **Personal Milestones:** Bront finished watching \"The Last Airbender\" and shared a catch story, while Jake Kurtz celebrated his new age.\n- **Controversial Topics:** Heated discussions about vaccines, the efficacy of online education during the pandemic, and the state of the economy.\n- **Group Gatherings Planned:** Excitement around an upcoming meetup dubbed \"Being Preppy.\"\n\n### Main Topics of Discussion:\n1. **Tech Companies and IPOs:** Conversations centered around the legitimacy of companies like Nikola and their products, leading to a debate on whether they are just hyped-up vaporware.\n2. **Personal Achievements:** Members shared updates on personal milestones, including achievements in gaming and life events like birthdays.\n3. **Pandemic Impacts:** Discussions on the ongoing effects of COVID-19 on education, health policies, and personal lives.\n4. **Upcoming Events:** Planning and excitement about the \"Being Preppy\" event, including who would attend.\n\n### Emotional States:\n- **Humor and Sarcasm:** The group maintained a light-hearted, humorous tone throughout, using memes and jokes to cope with serious topics.\n- **Frustration and Anxiety:** Moments of anxiety were evident in discussions about job stability, health concerns, and pandemic-related issues.\n- **Unity and Support:** Members rallied around those sharing personal struggles, offering support and camaraderie.\n\n### Controversies:\n- **COVID Vaccine Discussion:** A debate broke out regarding the ethics and safety of vaccines, especially the Russian vaccine.\n- **Education During the Pandemic:** Heated arguments about the effectiveness of online education and how colleges are handling the crisis.\n\n### Personal Updates and Life Events:\n- **Bront:** Finished watching \"The Last Airbender,\" caught a fish, and had a successful work week.\n- **Jake Kurtz:** Celebrated his birthday, revealing he shares a birth month with Bront.\n- **Zooks:** Shared news about his job loss, but received two months of severance pay, making the situation less dire.\n\n### Best Line of the Week:\n\"Reject modernity. Embrace Pachycephalosaury.\" - Juulio Jones\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc:\nAs the week kicked off, the group found themselves neck-deep in discussions about the latest tech IPOs, particularly Nikola Motors. Bront led the charge, questioning how these companies, seemingly lacking in real products, were already hitting the stock market. Hubert chimed in with his signature sarcasm, labeling Nikola as \"vaporware,\" which had everyone cracking up.\n\nMeanwhile, Hubert was all about sharing his virtual reality gaming experiences, particularly with Beat Saber—a game that not only tested their rhythm but also turned out to be quite the workout. Nudey was keen to join in on the fun, clearly excited about the prospect of some friendly competition.\n\nPersonal milestones kept the mood lively, with Bront revealing he had finished watching \"The Last Airbender\" and even caught a fish, while Jake Kurtz celebrated his birthday amidst birthday banter. The realization that both he and Bront were the same age led to a humorous duel challenge between the two, showcasing their camaraderie.\n\nHowever, it wasn’t all fun and games. The group dove into some serious discussions about the ongoing pandemic and its impact on education. Many expressed concerns about the efficacy of online classes and how colleges were handling the situation. Randy's insightful comments on the economic implications of keeping colleges open sparked a heated debate.\n\nTowards the end of the week, the excitement built around the upcoming \"Being Preppy\" event. As everyone shared their plans, it seemed the perfect opportunity for the group to reconnect and share laughs in person.\n\n### Character Spotlights:\n- **Bront:** The ever-curious and humorous member, balancing serious discussions with light-hearted memes. His recent fishing story added a personal touch to the week.\n- **Jake Kurtz:** The birthday boy who kept the group entertained with his youthful banter and was the target of many inside jokes.\n- **Hubert Cumberdale:** The master of sarcasm, always ready to comment on the absurdity of discussions while maintaining a fun-loving atmosphere.\n- **Nudey:** The gaming enthusiast who brought energy into the VR discussions, highlighting the group's shared interests.\n- **Zooks:** The group’s realist, who candidly shared his job loss while remaining optimistic about future opportunities.\n\n### Humorous Moments:\n- The week was filled with laughs, especially during the tech discussions, where Bront's quips about needing to slap a chicken at 3,725.95 mph to cook it had"
    },
    {
        "week_starting": "2020-08-31",
        "week_ending": "2020-09-06",
        "summary": "### Weekly Recap: August 31 - September 6, 2020\n\n#### Summary Section:\n\n**Key Highlights:**\n- The group had a hilarious week filled with inside jokes, tech discussions, and personal updates.\n- Jake shared his streaming woes and the group bantered about the inefficiencies of streaming services.\n- Hubert and Bront engaged in a detailed discussion about the newly announced Nvidia graphics cards.\n- Randy experienced a major loss with Taco Bell's Mexican Pizza being removed from the menu, leading to a heartfelt discussion.\n- Several members shared personal updates, including Jack's successful exit interview and Randy's dog’s birthday.\n\n**Main Topics of Discussion:**\n- **Streaming Services:** Many members expressed frustration with their streaming services, leading to a humorous exchange about the number of subscriptions.\n- **Politics:** The group had a light-hearted debate about political figures, showcasing their unique sense of humor.\n- **Gaming and Tech:** Hubert and others discussed the latest graphics cards and gaming setups, highlighting their shared interests in gaming.\n- **Life Updates:** Members shared personal milestones, including job updates and family news.\n\n**Emotional States:**\n- The mood was predominantly light-hearted and humorous, with moments of camaraderie and friendly banter.\n- Some anxiety surfaced regarding personal life challenges, particularly around job security and navigating college during COVID-19.\n\n**Controversies:**\n- A light-hearted disagreement arose about political humor, particularly surrounding Trump and Biden, prompting some playful jabs among members.\n- The removal of the Mexican Pizza from Taco Bell's menu sparked frustration and a bit of mourning from Randy.\n\n**Personal Updates and Life Events:**\n- Jake shared his streaming frustrations and reminisced about his family’s dog, Fonzie.\n- Jack had a successful exit interview and received a cash tip from his boss.\n- Randy celebrated his dog Ava's birthday and shared a sad story about Taco Bell's menu cut.\n\n**Best Line of the Week:**\n“Why won’t girls talk to me?” - Jake Kurtz\n\n---\n\n### Narrative Section:\n\nWhat a week, folks! As we rolled into September, the group was buzzing with energy and camaraderie, albeit with a hint of frustration. Jake kicked off the week with a classic lament about the streaming services that had betrayed him over the weekend. “My streaming services have been ass all weekend!” he exclaimed, sparking a lively debate about the absurdity of having multiple subscriptions but still not being able to watch what you want. Hubert chimed in, “Boy, it’s good that people use 16 different streaming services instead of cable!” Cue the laughter and a collective groan about the state of modern entertainment.\n\nMeanwhile, Bront seized the opportunity to share a link for a tech poll, which led to a playful exchange about political affiliations and the ever-controversial figures of Trump and Biden. Jack Lonneman threw in some comedic relief with his quips, “Has anyone ever laughed with Biden and not at his expense?” The group’s banter was sharp, showcasing their ability to tackle serious topics with humor.\n\nAs the week progressed, Hubert and Bront dived deep into a discussion about the new Nvidia graphics cards, with Hubert enthusiastically sharing how they could revolutionize gaming setups. “I might cop,” he said, teasing a potential upgrade. The tech talk was a hit, drawing in members who shared their own experiences and aspirations for the latest gadgets.\n\nIn the midst of all this, Randy dropped a bombshell that sent shockwaves of despair through the group: Taco Bell had axed the beloved Mexican Pizza from their menu. “I’m seriously distraught,” he shared, which led to a heartfelt discussion about the memories tied to that menu item, especially his nostalgic recollections with his grandmother. The conversation took a sentimental turn, with everyone rallying to console Randy over the loss.\n\nOn the personal front, Jack had a moment to celebrate as he reported back from his exit interview, where he snagged an unexpected $300 tip from his boss. “That’s pretty cool,” he said, basking in the glow of his success. Meanwhile, Randy was in a festive mood, celebrating his dog Ava’s sixth birthday, which included sharing a cupcake photo that melted the group’s hearts.\n\nAs the week closed, the group’s dynamic shone through with lighthearted jokes, tech debates, and personal updates. They navigated through the ups and downs of life while maintaining their unique sense of humor. Whether it was Jake’s existential crisis over why girls won’t talk to him, or Hubert's computer woes, every moment contributed to the rich tapestry of their friendship.\n\nAnd as always, the week concluded with the quintessential “WOOOOAAAAHHH OHHHHHHHHH” echoing through the chat, a reminder of the camaraderie and fun that defined their interactions. Here’s to another week of laughs and shared experiences!"
    },
    {
        "week_starting": "2020-09-07",
        "week_ending": "2020-09-13",
        "summary": "## Weekly Recap (September 7, 2020 - September 13, 2020)\n\n### Summary Section\n\n**Key Highlights:**\n- Tre's chaotic experience with a messy housemate who finally moved out.\n- Discussions about the challenges and absurdities of remote work and schooling during COVID-19.\n- Fantasy football drafts sparked debates and team management strategies.\n- A variety of humorous exchanges on pop culture, food, and the trials of adulting.\n\n**Main Topics of Discussion:**\n1. **Tre's Housemate Drama:** Tre shared his frustrations about a housemate who overstayed their welcome and left a mess.\n2. **Fantasy Football:** The group engaged in lively discussions about their fantasy football teams, strategies, and draft picks.\n3. **COVID-19 and Remote Life:** Members reflected on the challenges of remote work and schooling, with humorous anecdotes about their experiences.\n4. **Pop Culture:** Various references to movies, shows, and memes filled the chat, including discussions about \"Dune,\" \"Tenet,\" and other media.\n\n**Emotional States:**\n- **Humorous:** The group maintained a light-hearted tone, often joking about their personal situations and the absurdity of the world.\n- **Frustrated:** Tre expressed genuine frustration over his messy housemate, while others shared their grievances about work and remote learning.\n- **Nostalgic:** Many members reflected on their college years and the changes brought about by the pandemic.\n\n**Controversies:**\n- A few heated exchanges occurred over differing opinions on cleaning standards and expectations during shared living situations.\n- Light-hearted banter about political and social issues, notably around the handling of COVID-19 and its impact on society.\n\n**Personal Updates and Life Events:**\n- Tre shared that his chaotic housemate finally moved out, bringing him relief.\n- Randy mentioned his new job and the absurdity of working from home.\n- Multiple members discussed their fantasy football teams and upcoming drafts, highlighting the camaraderie and competitiveness.\n\n**Best Line of the Week:**\n\"Honestly, I’d rather have that dude than 3/4 of my roommates last year.\" - Jack Lonneman, referring to Tre's messy housemate.\n\n---\n\n### Narrative Section\n\nThis week kicked off with Tre in a state of chaos, dealing with a housemate who had overstayed his welcome and was leaving a trail of mess that would make a raccoon cringe. Tre vented about the absurdity of living with someone who used PTSD as an excuse for not cleaning up. The group couldn’t help but chuckle at the irony of the situation, with Jack Lonneman offering a humorous take, stating he’d rather have Tre's messy friend than some of his past roommates. As the week unfolded, we witnessed Tre's relief when the housemate finally moved out, freeing him from the mess and drama.\n\nMeanwhile, the fantasy football league was a hot topic! Everyone was gearing up for drafts, strategizing their picks, and sharing the inevitable anxiety that comes with assembling a winning team. Aaron D was diving into his first fantasy football experience, asking for tips, while others chimed in with their best and worst draft day stories. The banter was lively, with everyone trying to one-up each other with their team management skills. \"Take a kicker in the first round,\" Juulio Jones joked, sparking a round of laughter.\n\nCOVID-19 continued to cast a long shadow over daily life, leading to more discussions on remote work and schooling. Bront shared a nostalgic moment about the ease of in-person interactions versus the awkwardness of Zoom meetings. \"I dislike this Zoom waiting room shit for office hours,\" he lamented, while others shared their own experiences of navigating online classes and video calls. There was a general consensus that remote life had its perks but also a mountain of quirks that were hard to adjust to.\n\nPop culture references flowed freely as the group discussed everything from the latest movies to memes that were just too relatable. Tre's excitement about the new \"Dune\" trailer echoed through the chat, and it wasn’t long before everyone chimed in with their thoughts on the film's hype train. The group also bonded over food, with several members sharing their culinary adventures or mishaps, leading to a side discussion about the best places for takeout during this pandemic.\n\nAs the week wrapped up, it was evident that while life was throwing its challenges at the group, they were navigating it all with humor and camaraderie. Whether it was through the shared frustrations of messy roommates, the competitive spirit of fantasy football, or the laughter brought on by inside jokes, the bond within this group remained strong.\n\nIn the end, it was a week filled with relatable chaos, meaningful connections, and plenty of laughter—just what they needed to keep spirits high in these wild times!"
    },
    {
        "week_starting": "2020-09-21",
        "week_ending": "2020-09-27",
        "summary": "# Weekly Recap: September 21 - September 27, 2020\n\n## Summary Section:\n\n### Key Highlights:\n- **Gaming News:** Excitement about the upcoming Xbox console release; debates on the implications of Microsoft acquiring ZeniMax Media.\n- **Personal Triumphs:** Jack Lonneman celebrated a solid exam score (87) in his toughest class and shared his golfing achievements.\n- **Health Concerns:** Juulio Jones tested positive for COVID-19, which sparked a lively discussion about symptoms and experiences.\n- **Banter and Jokes:** The group continued their tradition of humor, with plenty of inside jokes and memes shared throughout the week.\n- **Cultural Discussions:** The group debated various movies and shows, including *One Flew Over the Cuckoo's Nest* and *The Boys*.\n\n### Main Topics of Discussion:\n- **Gaming:** Ongoing conversations about Xbox, PlayStation, and the effects of COVID-19 on the gaming industry.\n- **Health:** Juulio Jones' COVID-19 diagnosis led to discussions on symptoms and the group's experiences with the virus.\n- **Movies and TV Shows:** Reviews and thoughts on classic films and current streaming shows, including *The Boys* and *Cobra Kai*.\n- **Personal Updates:** Various members shared updates about work, health, and personal life, including promotions and academic achievements.\n\n### Emotional States:\n- **Laughter:** The mood was generally light-hearted, filled with humor and jokes.\n- **Concern:** Juulio's COVID-19 news brought a somber tone and concern among friends.\n- **Excitement:** Anticipation surrounding video game releases and personal milestones created an energetic atmosphere.\n  \n### Controversies:\n- **Vaccine Skepticism:** Juulio's diagnosis prompted some lighthearted skepticism about the seriousness of COVID.\n- **Political Discussions:** Conversations about protests and social justice spurred mixed reactions among members, showcasing differing opinions.\n\n### Personal Updates and Life Events:\n- **Jack Lonneman:** Celebrated an 87 on a difficult exam and played well in golf.\n- **Hubert Cumberdale:** Shared experiences with gaming and discussed his thoughts on the future of console gaming.\n- **Juulio Jones:** Announced he tested positive for COVID-19, leading to concern and advice from the group.\n- **House Mom:** Announced a promotion at work, reflecting on her career progress.\n\n### Best Line of the Week:\n\"Bruh, only real men will understand this.\" – Aaron D\n\n## Narrative Section:\n\nWhat a week it was in the GroupMe world! As we dove into the conversations from September 21 to 27, the usual mix of hilarity and heartfelt moments was on full display. \n\n**The Week Begins:**\nMonday started with Jake Kurtz dropping some gaming news bombs. The imminent release of the new Xbox had everyone buzzing, particularly Randy, who jokingly declared he’d be getting a “free Xbox” when the riots start post-election. Meanwhile, Jack Lonneman, fueled by some questionable late-night decisions, announced he wanted to start meal prepping—only to be met with laughter from the gang. Hubert chimed in with his frozen pizza method, proving once again that he’s the king of lazy meal prep.\n\n**Midweek Revelations:**\nBy midweek, the mood shifted slightly when Juulio Jones shared that he might have COVID. His symptoms—coughing, fatigue, and an alarming lack of taste—were met with a mix of concern and humor from the group. “My Fred Flintstone vitamins are going to save me,” he quipped, trying to lighten the mood. The group rallied around him, sharing their own experiences and giving advice, all while managing to keep the humor alive with jokes about eating bats. \n\nIn the midst of all this, Jack celebrated a personal victory, acing an exam and hitting a solid 98 on the golf course. “87 on the first exam of my toughest class,” he announced, prompting cheers and some good-natured ribbing about his golfing skills. \n\n**Pop Culture & Politics:**\nAs the week continued, the crew debated their latest movie watches. Discussions about *One Flew Over the Cuckoo's Nest* and *The Boys* led to some spirited exchanges. Randy, known for his strong opinions, remarked on the absurdity of having no Marvel content for what felt like forever, while others chimed in about the joys of streaming services. \n\nThe political climate also seeped into the chat, with discussions around protests and recent verdicts causing some heated exchanges. “This is why I’m so tired of hearing about cops,” vented one member, leading to a back-and-forth about the state of affairs in America. \n\n**Wrapping Up the Week:**\nAs the week came to a close, the group shared memes, inside jokes, and personal updates. Bront finally opened a brokerage account to invest, aiming for a down payment on a home—much to the excitement and encouragement from the others. \n\nAnd just as the gang was settling down for the weekend, Jake shared a nostalgic video, prompting the classic “You heard it here first” line, which sent everyone into fits of laughter. \n\nIn summary, this week was filled with gamin"
    },
    {
        "week_starting": "2020-09-28",
        "week_ending": "2020-10-04",
        "summary": "# Weekly Recap: September 28 - October 4, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **New Beginnings**: There was excitement about Michael's new yoga studio in NYC.\n- **Fashion Follies**: Bront and Nudey showcased their latest corduroy hauls from Vestis, sparking a lively fashion debate.\n- **Musical Discoveries**: Jack shared his newfound love for bluegrass music, leading to a hilarious discussion about the \"new\" vs. \"old\" bluegrass.\n- **Funny Mishaps**: A series of humorous exchanges around car troubles, including Nudey’s Subaru Forester saga.\n- **Political Banter**: An ongoing conversation surrounding the upcoming elections, with plenty of jokes about candidates and the current political climate.\n\n### Main Topics of Discussion:\n- **Fashion**: Bront’s corduroy obsession and Nudey’s shopping spree at Vestis.\n- **Music**: Bluegrass discussions, with Jack introducing the group to Billy Strings and Molly Tuttle.\n- **Automotive Issues**: Nudey’s car troubles and the resulting banter about buying new cars.\n- **Work and Jobs**: Discussions about LinkedIn and work environments amid the pandemic.\n- **Political Commentary**: Reflections on the political climate, especially regarding Trump's health and the upcoming elections.\n\n### Emotional States:\n- **Humorous**: The group maintained a light-hearted tone, filled with jokes and playful banter.\n- **Reflective**: Some members shared personal challenges, such as Jack dealing with a breakup.\n- **Excitement**: There was palpable excitement about new job opportunities and lifestyle changes.\n\n### Controversies:\n- **Fashion Debates**: Disagreements over the merits of corduroy and whether certain brands were worth the hype.\n- **Political Jokes**: The group had differing opinions on current political figures, sparking some lighthearted arguments.\n\n### Personal Updates and Life Events:\n- **New Jobs**: Several members hinted at job changes or new opportunities.\n- **Car Troubles**: Nudey faced significant car issues, leading to a mix of sympathy and jokes about his vehicle's fate.\n- **Music Discoveries**: Jack shared his newfound love for bluegrass, indicating a shift in his musical preferences.\n\n### Best Line of the Week:\n\"Carolina? Pines? First in flight?\" – Randy, humorously referencing the classic North Carolina motto while discussing music.\n\n---\n\n## Narrative Section\n\nAh, what a week it has been, folks! We kicked off the week with Michael sharing his excitement over a new yoga studio in New York, which we’re all keen to check out when the world becomes a bit less chaotic. In true group fashion, Aaron chimed in with a classic quip about how \"no one lives in NY anymore,\" proving once again that our banter is as consistent as ever. \n\nMeanwhile, Bront and Nudey took center stage with their latest fashion hauls from Vestis, leading to a hilarious back-and-forth about corduroy. Bront's enthusiasm was palpable as he showed off his jacket, and Nudey couldn’t help but brag about having enough corduroy for a lifetime. Who knew fabric could ignite such passion?\n\nJack, not to be outdone, opened a musical Pandora's box by introducing the crew to Billy Strings and the world of bluegrass. Hubert couldn’t resist poking fun, asking if Jack was now a \"liberal\" for embracing the genre. If you thought we had a musical divide in the group, think again! Everyone dove into debates about the \"new\" vs. \"old\" bluegrass, with Jack defending his newfound love like it was a rare Pokémon card.\n\nAs the week progressed, Nudey’s car troubles took center stage, with discussions on whether it would survive the repairs. The jokes flowed freely as Aaron quipped about maybe breaking the window and claiming it was a diamond shard. It’s amazing how quickly car troubles can turn into comedic gold in this group.\n\nOn the work front, our discussions about LinkedIn turned into a roast session when Hubert declared he hated the platform. Aaron chimed in, saying it felt like the new Facebook with all the “attention whoring” happening. We all related, reminiscing about the good old days when social media was just about sharing memes instead of job updates.\n\nAs the week wrapped up, the political climate became a hot topic with Trump’s health updates dominating the conversation. Randy humorously mused about the absurdity of the situation, and the group couldn’t help but riff off each other’s jokes regarding political candidates, all while trying to maintain some semblance of sanity in these wild times.\n\nReflecting on personal updates, Jack shared a moment of vulnerability regarding his recent breakup. It was a reminder that amidst all the humor, we support each other through the ups and downs. The group rallied, offering encouragement and some classic humor to lighten the mood.\n\nBy the weekend, we were ready to dive into some serious autumn vibes, with talks of pumpkin patches and fishing plans. Jake was particularly excited about heading to the pumpkin patch, and the banter continued as we shared our autumn traditions"
    },
    {
        "week_starting": "2020-10-05",
        "week_ending": "2020-10-11",
        "summary": "# Weekly Recap: October 5 - October 11, 2020\n\n## Summary Section:\n\n### Key Highlights:\n- **Bront's Relationship Talks**: Bront opened up about his relationship struggles, sparking deep conversations among the group.\n- **Randy's Watch Repair**: Randy discussed the cost of repairing his watch, leading to humorous banter about expensive timepieces.\n- **Jake's Dog-Sitting Adventure**: Jake shared his experiences dog-sitting a pug, providing some comic relief.\n- **Gaming Discussions**: The group shared their thoughts on recent shows like *The Boys* and gaming experiences, particularly with *Star Wars Squadrons*.\n- **Political Jokes**: With the election approaching, political humor was rampant, including discussions on stimulus checks.\n\n### Main Topics of Discussion:\n- **Life Updates**: Bront’s relationship dynamics, Randy’s watch repair, and Jake’s dog-sitting.\n- **Political Climate**: The group discussed the ongoing political landscape and its impact on their lives.\n- **Pop Culture**: Conversations revolved around TV shows, movies, and gaming experiences.\n- **Fashion and Lifestyle**: Members shared opinions on fashion brands and personal style choices.\n\n### Emotional States:\n- **Humor and Sarcasm**: The group maintained a light-hearted atmosphere with constant jokes and banter.\n- **Reflection and Concern**: Bront's relationship discussions led to moments of serious reflection, while others expressed concern for him.\n- **Excitement and Anticipation**: Members were eager to discuss upcoming shows and gaming releases.\n\n### Controversies:\n- **Political Jokes**: Light-hearted jabs about politics occasionally sparked mixed reactions, especially with the upcoming election.\n\n### Personal Updates and Life Events:\n- **Bront**: Discussed his relationship struggles and potential moves.\n- **Randy**: Mentioned the potential cost of watch repairs, sparking a conversation about watch culture.\n- **Jake**: Shared his experience dog-sitting a pug and how it’s going.\n\n### Best Line of the Week:\n“First they slowed our speeds and no one spoke up—gamers being persecuted.” - Hubert Cumberdale\n\n## Narrative Section:\n\nThis week was a rollercoaster of emotions, laughter, and revelations. It all started with Bront throwing a curveball into the chat by voicing his struggles with his relationship. “I don’t understand why she hasn’t gone back to work,” he lamented, prompting a deep dive into the intricacies of love during a pandemic. The gang rallied around him, offering advice and sharing their own tales of heartache and growth, proving once again that no matter the distance, these conversations keep them close.\n\nMeanwhile, Randy was in a different kind of distress, pondering the hefty price tag on his watch repair. “$550 for a fix?” he exclaimed, leading to a lively discussion filled with jokes about the absurdity of watch culture. “I’d rather buy a new one!” he joked, to which Bront quipped, “$600 for a GPU, now that’s a deal!” This sparked a side debate on the merits of spending money on tech versus timepieces, with everyone chiming in with their opinions.\n\nJake kept the mood light with his dog-sitting adventure. “Owning a pug must be something else,” he said, sharing funny anecdotes about the little potato he was looking after. The gang couldn't help but poke fun, declaring that pugs were “an abomination of human creation,” yet somehow irresistibly cute. This led to a delightful series of exchanges about the absurdities of dog ownership, with everyone weighing in with their own experiences.\n\nAs the week progressed, the group found solace in their shared interests in pop culture. They dissected the latest episode of *The Boys*, with Hubert enthusiastically sharing his thoughts on the finale. “It’s good for sure,” he said, while others chimed in with their favorite moments from the series. Jake also jumped in with excitement about *Star Wars Squadrons*, leading to a mini gaming session and plenty of memes being exchanged.\n\nThe political atmosphere, as always, provided ample fodder for jokes. With the election looming, the group found themselves in a comedic frenzy, tossing around quips about stimulus checks and political antics. “The check please!” became a rallying cry as they lamented the delays in much-needed financial relief, underscoring the absurdity of the situation with laughter.\n\nBy the end of the week, Bront's introspective musings had sparked a broader conversation about life choices, relationships, and personal growth. “I just want to be around the right people,” he concluded, resonating with many in the group who were on their own journeys of self-discovery. \n\nThis week encapsulated everything that makes this group special: a blend of humor, heart, and the occasional existential crisis, all woven together in a tapestry of shared experiences. Whether it was discussing the latest in fashion, sharing personal triumphs and tribulations, or just poking fun at each other, these moments remind them all that even in the chaos, there’"
    },
    {
        "week_starting": "2020-10-12",
        "week_ending": "2020-10-18",
        "summary": "# Weekly Recap: October 12 - October 18, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Dennis's Wedding:** Dennis got married, sparking a flurry of congratulations and playful jabs about the institution.\n- **Golfing Adventures:** Several group members discussed their recent rounds of golf, with Jack lamenting his putting while Juulio celebrated a triumphant race win in a video game.\n- **Fantasy Football Frustrations:** The group shared their woes and triumphs in fantasy football, with some hilarious moments about poor player choices and bad luck.\n- **Political Discussions:** The group touched on current events, including voting and opinions on candidates, with humorous and sarcastic takes.\n- **Inside Jokes:** Classic inside jokes resurfaced, especially about food preferences, childhood memories, and the absurdities of adult life.\n\n### Main Topics of Discussion:\n1. **Dennis's Wedding:** The day was filled with excitement and jokes about marriage.\n2. **Golfing:** A recurring theme with discussions about techniques, mishaps, and personal bests.\n3. **Fantasy Football:** Shared experiences and humorous critiques of each other's teams.\n4. **Political Climate:** Conversations around voting and the upcoming election.\n5. **Food and Drink:** Ongoing debates about favorite dishes, particularly involving Taco Bell and comfort food.\n\n### Emotional States:\n- **Joyful and Celebratory:** The mood was upbeat with laughter surrounding Dennis's wedding.\n- **Frustration:** Jack expressed frustration over his golf game, and others shared their fantasy football woes.\n- **Reflective and Sarcastic:** The political discussions elicited a mix of humor and serious reflection on current events.\n\n### Controversies:\n- **Food Preferences:** Light-hearted arguments about food choices (e.g., disdain for certain toppings and fast food items).\n- **Fantasy Football Decisions:** Heated debates on strategy and player choices led to some playful disagreements.\n\n### Personal Updates and Life Events:\n- **Dennis's Marriage:** A major milestone celebrated by all.\n- **Juulio's Video Game Success:** Juulio celebrated his victory in racing games, contrasting with his earlier frustrations.\n- **Bront's Exam Prep:** Bront prepared for upcoming exams, seeking time off from work.\n\n### Best Line of the Week:\n\"Virgin city living and public transit vs Chad rural living and own a sprint car.\" - Juulio Jones, perfectly encapsulating the group's humor about lifestyle choices.\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc:\nWhat a wild week it has been for the crew! Kicking off the week, we were buzzing with excitement as we celebrated Dennis’s wedding. The group was on fire with playful banter, ribbing him with classic wedding jokes and sharing their own thoughts on the institution of marriage. It was the kind of joyful chaos that only a bunch of friends could create.\n\nAs the week rolled on, Jack was out on the golf course, lamenting over his putting game. “I would have had a 92 if I 2-putted every 3-putt!” he exclaimed, the frustration palpable through the group chat. Meanwhile, Juulio was riding high after a triumphant win in a racing game, proving once again that sometimes virtual victories can feel just as good as the real thing.\n\nThe discussions seamlessly transitioned into the realm of fantasy football, where everyone had a story of woe. Aaron was particularly vocal about his team's struggles, and the group shared endless laughs at Juulio's misfortune of neglecting to play a defense. “Imagine losing this week,” Jake said, reveling in the camaraderie of shared pain and victory.\n\nAmidst the laughter, serious discussions about the political climate crept in, as the group debated the upcoming election. With humor as their armor, they tackled heavy topics, making light of the absurdities that seem to come with every election cycle. Randy’s quip about wanting to see his favorite Taco Bell menu item return sparked a lively discussion about fast food nostalgia, proving that some loves never die.\n\nAs the weekend approached, Jack was pumped for golf while Randy was preparing for a big dinner for his mom’s retirement. “Filet goin up tonite,” he shared, hinting at a feast that would surely involve some good drinks. Meanwhile, Juulio couldn’t shake off the cold as he prepared for a NASCAR race, highlighting the chill running through the air.\n\nFinally, as we wrapped up the week, the group was in full swing with random memes, food debates, and even some light-hearted back-and-forth about who could throw down the best pumpkin carving (spoiler: Juulio nailed it). The camaraderie was palpable, and no one could deny the bond that kept this ragtag group of friends coming back for more, week after week.\n\n### Character Spotlights:\n- **Dennis:** The newlywed, who took all the jabs about marriage in stride, showing that he’s got a good sense of humor about his new life chapter.\n- **Jack:** The golfer of the group, who, despite his putting struggles, remains optimistic "
    },
    {
        "week_starting": "2020-10-19",
        "week_ending": "2020-10-25",
        "summary": "# Weekly Recap: October 19 - October 25, 2020\n\n## Summary Section\n\n### Key Highlights:\n- Randy successfully fixed his PlayStation controller after facing issues while gaming.\n- Hubert resolved his internet speed problems by changing network channels.\n- Bront tested a friend's GPU, confirming his own setup was fine.\n- The group engaged in discussions about gaming, tech upgrades, and personal fitness challenges.\n- Many members shared thoughts on various shoe brands for travel and hiking.\n- Inside jokes about various pop culture references, including Borat and the upcoming elections.\n\n### Main Topics of Discussion:\n1. **Tech Troubles**: Randy's PlayStation issues sparked a discussion on gaming tech, including SSD upgrades and controller malfunctions.\n2. **Personal Fitness**: The group shared their fitness challenges, including planks, squats, and running distances.\n3. **Upcoming Events**: Conversations revolved around Halloween plans, weddings, and the upcoming election.\n4. **Pop Culture**: The release of Borat 2 ignited lively discussions and memes, reflecting the group's shared humor.\n\n### Emotional States:\n- The mood was lighthearted and humorous overall, with plenty of banter and teasing. \n- There were moments of concern about personal challenges, particularly regarding fitness and family issues.\n\n### Controversies:\n- Some light-hearted disagreements emerged over the quality of fast-food chicken sandwiches (Popeyes vs. Chick-fil-A).\n- A spirited debate about the merits of various gaming consoles and tech specs, alongside banter about political opinions.\n\n### Personal Updates and Life Events:\n- Jack Lonneman shared his fitness journey and experiences running.\n- Dennis returned to the chat after his wedding, sparking nostalgia and jokes.\n- Several members discussed their ongoing struggles with work-life balance and the pandemic's impact on their routines.\n\n### Best Line of the Week:\n“Imagine having your son develop a coke habit and Jack is the one you have to rely on as in loco parentis. Terrifying shit.” - Jack Lonneman\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc\nThis week started with Randy’s gaming woes, as he struggled with his PlayStation controller while trying to finesse his way through a round of PGA 2K. After some back-and-forth troubleshooting in the group chat, he finally found a solution that involved a paperclip and some good old-fashioned reset magic. “Fingers crossed!” he declared, and it worked, sending a wave of virtual high-fives through the chat. \n\nMeanwhile, Hubert was celebrating his own tech victory as he managed to fix his internet issues after a week of slow speeds. “Changed the channels on both networks, and it’s running normal now!” he proudly shared, prompting Bront to jump in with his own tech saga about testing a friend's GPU. The group’s ongoing tech troubles turned into a running joke, especially as the SSD upgrade discussions ramped up, leading to the familiar refrain of “SATA go brrrrr.”\n\nFitness challenges were also a hot topic this week, with Jack proudly announcing he hit a new running milestone, while Aaron lamented his lack of motivation. “I haven’t been running lately; I need to get back into it at some point,” he mused, though Jack encouraged him to get on board with his latest fitness challenge. The group found plenty of humor in their shared struggles, with Randy jokingly saying, “You should have made more Orbi memes; that’s how I got mine!” \n\nThe chat also turned towards personal milestones and life updates, with Dennis dropping back in after his wedding. The group quickly filled him in on all the inside jokes he missed while he was off living the “boomer life.” \n\nAs the week progressed, pop culture references flowed freely, especially with the release of Borat 2. Jack and Kurtz took the chance to share their thoughts, leading to a steady stream of memes and jokes that had everyone in stitches. The week wrapped up with a mix of excitement for the upcoming Halloween festivities and the looming elections, with everyone sharing their plans and making light of the political chaos.\n\n### Character Spotlights\n- **Randy**: The unofficial tech guru of the group, he navigated through controller issues with a mix of humor and frustration, embodying the ultimate gamer spirit.\n- **Hubert**: Always ready with tech advice and solutions, Hubert’s internet triumph was a highlight, showcasing his knack for problem-solving.\n- **Bront**: The group’s resident gamer and tech enthusiast, he provided updates on his own GPU tests and plans for Black Friday shopping.\n- **Jack Lonneman**: Enthusiastic about fitness, Jack shared his running milestones while also engaging in light-hearted banter about his fraternity's antics.\n- **Aaron D**: Balancing his work and fitness, Aaron's humor shone as he navigated through discussions about fantasy football and tech woes.\n- **Dennis**: Fresh from his wedding, Dennis brought a nostalgic touch to the chat, filled with references to his new lif"
    },
    {
        "week_starting": "2020-10-26",
        "week_ending": "2020-11-01",
        "summary": "# Weekly Recap (October 26 - November 1, 2020)\n\n## Summary Section\n\n### Key Highlights:\n- **Food Discussions**: Lots of food talk, from Hubert's pan-seared steak to Brums’ exercise bike delivery.\n- **Political Musings**: Group discussed election anxieties and mail-in voting.\n- **COVID Realities**: Tom shared updates about his workplace COVID protocols.\n- **Personal Updates**: New jobs, health updates, and relationship talks filled the week.\n- **Halloween**: Conversations ranged from costumes to Halloween plans, including a few spooky stories.\n\n### Main Topics of Discussion:\n1. **Food Adventures**: Recipes, cooking hacks, and cravings dominated the chat.\n2. **Political Climate**: Election discussions were a recurring theme, highlighting fears and predictions.\n3. **Health and Wellness**: Updates on personal health, including COVID-19 impacts and new job roles.\n4. **Pop Culture**: Movies and shows, particularly Wes Anderson films and the latest episodes of \"The Mandalorian.\"\n5. **Life Events**: Celebrations of personal milestones, including birthdays and new job roles.\n\n### Emotional States:\n- **Humor and Sarcasm**: The group maintained a lighthearted banter, filled with jokes and memes.\n- **Anxiety**: Political discussions revealed underlying stress about the upcoming election.\n- **Supportive**: Members shared personal updates and supported one another through various life transitions.\n\n### Controversies:\n- **Political Opinions**: Debates about mail-in voting and election integrity sparked some heated discussions.\n- **Food Preferences**: Light-hearted banter about food choices led to playful arguments, especially regarding dessert.\n\n### Personal Updates and Life Events:\n- **New Jobs**: Jake celebrated his first day back at the office (briefly).\n- **Health Updates**: Randy shared about his new winter coat purchase and ongoing discussions about vitamin D.\n- **Birthdays**: Jake's birthday month kicked off, bringing excitement.\n\n### Best Line of the Week:\n“Won’t someone think of the fellas who like fellas!” - Jack Lonneman, referencing a humorous take on societal issues.\n\n---\n\n## Narrative Section\n\nAs the week began on October 26, the air was buzzing with excitement and a hint of anxiety as everyone braced for the impending election. The group kicked off conversations with culinary delights, with Jack Lonneman exclaiming about his new favorite docuseries while Hubert Cumberdale bragged about his pan-seared steak. “Just did a pan sear with butter baste steak,” Hubert declared, prompting a flurry of food envy and recipe sharing.\n\nMeanwhile, the political discourse heated up with Randy quipping, “Mail-in voting is dumb. Just Pokémon go to the polls.” This light jab stirred up a mix of laughter and serious discussions about the election, with Bront expressing his “doomer mode” predictions. The group’s political banter was interspersed with jokes about the absurdities of the current climate, each member sharing their increasing frustrations.\n\nAs the week rolled on, personal updates started flooding in. Jake Kurtz humorously noted, “Day 1 into my office rotation… and they’re like nvm you can work from home 100% again.” His comedic timing kept spirits high, especially among those feeling the strain of work-life balance.\n\nMidweek, Tom shared a sobering update about his workplace, where masks were finally made mandatory after a COVID scare. “Welp everyone is getting sent home,” he wrote, highlighting the ongoing challenges everyone faced. His news led to a supportive exchange, with the group rallying around him with jokes and concern alike.\n\nHalloween brought a festive spirit to the chat. Discussions ranged from costume ideas to Brums’ excitement about his exercise bike delivery. “My excise bike comes tomorrow!” he announced, bringing cheers from the group. The playful banter continued as Jack joked about “a mid-00s gay fit,” referencing a humorous take on fashion choices.\n\nBy the weekend, the mood shifted slightly as the group prepared for Halloween festivities. As they shared their plans and last-minute costume ideas, Aaron humorously noted, “I’m gonna need to send mine out still,” echoing the common fear of procrastination.\n\nAs the clock ticked down to November 1, the anticipation for the election loomed larger. The group exchanged memes and predictions, with Jack Lonneman’s birthday month bringing a sense of lightness amidst the tension. “November bros, let’s goooo!” Jake proclaimed, rallying everyone for the month ahead.\n\nThrough laughter, food, and the occasional existential dread about the state of the world, the group showcased their resilience and camaraderie. Each chat, joke, and shared experience painted a vibrant picture of their lives, blending the mundane with the extraordinary, all while navigating the complexities of modern life together. \n\nAs they signed off for the week, it was clear: no matter what challenges lay ahead, they had each other’s backs—even if it meant enduring a few awkward Halloween storie"
    },
    {
        "week_starting": "2020-11-09",
        "week_ending": "2020-11-15",
        "summary": "# Weekly Recap: November 9 - November 15, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Election Aftermath:** Discussions about the recent election results and their implications, particularly the perceived end of COVID-19 with Biden's victory.\n- **Hubert's Engagement:** Hubert Cumberdale got engaged on Friday the 13th, leading to celebratory banter in the group.\n- **Jake's Birthday:** Jake Kurtz celebrated his birthday, receiving a box set of original Scooby Doo seasons, which spurred nostalgic conversations.\n- **Fraternity Drama:** Jack Lonneman shared humorous insights about fraternity election drama, including candidates with questionable backgrounds.\n\n### Main Topics of Discussion:\n1. **COVID-19 and Elections:** Ongoing conversations about the pandemic and its relation to the election outcome.\n2. **Personal Milestones:** Hubert's engagement and Jake's birthday were significant highlights of the week.\n3. **Fraternity Elections:** The discussion about fraternity candidates, with jokes about their qualifications and past misdeeds.\n4. **Gaming and Movies:** Conversations about video games, particularly the Mandalorian series, and upcoming releases.\n\n### Emotional States:\n- **Humor and Sarcasm:** The group maintained a light-hearted tone, filled with inside jokes and playful banter.\n- **Excitement:** Celebratory moods around personal milestones like engagements and birthdays.\n- **Frustration:** Some members expressed annoyance about the ongoing pandemic and political climate.\n\n### Controversies:\n- **Political Jokes:** Light-hearted debates surrounding political affiliations and the implications of the election results.\n- **Fraternity Concerns:** Concerns about the qualifications of candidates running for leadership, especially involving past drug dealings.\n\n### Personal Updates and Life Events:\n- **Hubert's Engagement:** Hubert proposed to his girlfriend, which became a key talking point.\n- **Jake's Birthday:** Jake turned 25 and shared his birthday celebration with the group.\n- **Dennis's Move:** Dennis completed his move to a new house, marking a significant life milestone.\n\n### Best Line of the Week:\n\"Well, since there’s hardly anyone left now it will probably be just me, Nudey, Zooks, and Aaron at the wedding!\" - Hubert Cumberdale\n\n---\n\n## Narrative Section\n\nWhat a week, huh? As the world grappled with the aftermath of the election, our GroupMe turned into a virtual clubhouse filled with laughter, inside jokes, and the occasional existential crisis. The highlight of the week? Hubert Cumberdale popping the big question and getting engaged on Friday the 13th! The group erupted in a chorus of congratulations and playful jabs about how he might be the first of us to settle down. “Congrats, Hube!” became the catchphrase of the week, with everyone speculating who might be next to tie the knot.\n\nMeanwhile, Jake Kurtz was out here celebrating his 25th birthday like it was the Super Bowl. With a box set of the original Scooby Doo seasons in hand, he basked in the nostalgia while the rest of us reminisced about our own childhood faves. The banter quickly turned to jokes about what it’s like to be “old,” with Randy quipping, “25 lol y’all are old.” \n\nAs for the fraternity drama, Jack Lonneman kept us entertained with stories about the upcoming fraternity elections. Apparently, one candidate, who has a past involving illegal dealings, wants to handle the entire social budget in cash. Jack joked, “45k in cash in a 20-year-old coke dealer's hands? Yeah, that’ll fly.” The group's witty banter didn’t let up as they reminisced about past fraternity hijinks, with Aaron D chiming in about a tee shirt order gone wrong. \n\nAmidst all the humor, we couldn’t escape the reality of our current situation. The pandemic and its implications for our lives were a constant backdrop. Conversations shifted from the election results to the ongoing discussions about COVID-19 and how it might all change with a new administration. “Now that Trump lost, the coronavirus is over,” joked Randy, sparking a playful debate about the pandemic's future.\n\nIn true group fashion, we navigated through the rollercoaster of emotions—celebration, sarcasm, and the occasional dose of reality. The week wrapped up with Jack planning a trip to Augusta with a buddy, hoping to catch a glimpse of the famed golf course, while the rest of us continued to share memes, jokes, and updates on our lives. As always, the camaraderie in this group made the ups and downs of life feel a little lighter, and we can’t wait to see what next week brings!"
    },
    {
        "week_starting": "2020-12-07",
        "week_ending": "2020-12-13",
        "summary": "# Weekly Recap: December 7 - December 13, 2020\n\n## Summary Section:\n\n### Key Highlights:\n- **Fantasy Football Drama**: Aaron D’s ongoing struggles in fantasy football led to heated discussions about team performances, especially surrounding Josh Allen and the Bills.\n- **Cyberpunk 2077 Release**: The much-anticipated game release sparked debates about bugs and performance, with group members sharing their experiences.\n- **Personal Life Updates**: Jack Lonneman shared updates about his family and a significant personal milestone in his studies.\n- **Holiday Talks**: Discussions about Christmas, gift ideas, and holiday plans took center stage as members made light of the season’s chaos.\n\n### Main Topics of Discussion:\n1. **Fantasy Football**: Aaron D lamenting his team's performance and Aaron's prayers for Josh Allen’s health.\n2. **Cyberpunk 2077**: Mixed reviews about the game’s performance, with humorous takes on its bugs and updates.\n3. **Personal Milestones**: Jack's impressive academic turnaround and Tom's challenging personal situation with his girlfriend’s health.\n4. **Holiday Plans**: Members sharing their plans for the upcoming holidays and Christmas shopping.\n\n### Emotional States:\n- **Humor & Sarcasm**: The group maintained a light-hearted mood, filled with jokes and playful banter.\n- **Concern**: Tom expressed worry about his girlfriend's health, leading to serious conversations amidst the humor.\n- **Excitement**: Anticipation for Cyberpunk 2077 and the holiday season brought a buzz to the chat.\n\n### Controversies:\n- **Fantasy Football Debates**: Heated discussions about player performances and strategies, particularly centered around Aaron's team and Josh Allen.\n- **Cyberpunk Performance Issues**: Disagreement over the game’s quality and the expectations set by hype.\n\n### Personal Updates and Life Events:\n- **Tom's Girlfriend**: Tom revealed his girlfriend has early onset heart failure, prompting concern and support from the group.\n- **Jack Lonneman’s Academic Progress**: Jack shared his impressive academic turnaround from a 2.0 to a 3.15 GPA, sparking pride and playful teasing from the group.\n- **Hubert's Engagement**: Hubert confirmed his engagement, marking a significant milestone in his life.\n\n### Best Line of the Week:\n“Imagine if I got surgery. A 6’7 170 lb lank god.” – Jack Lonneman, humorously reflecting on his physique and future plans.\n\n---\n\n## Narrative Section:\n\n### Week-by-Week Story Arc:\nThis week was a rollercoaster of emotions, from the highs of holiday cheer to the lows of personal challenges. The group found camaraderie in their shared love for fantasy football, particularly as Aaron D vented his frustrations about his team’s performance. The week kicked off with Aaron’s lighthearted prayer for Josh Allen’s health before Monday night football, igniting a cascade of memes and jokes about the Bills and their performance.\n\nAs the week unfolded, the long-awaited release of **Cyberpunk 2077** took center stage. The excitement was palpable, with members sharing their experiences and frustrations about the game’s bugs. “This is 100x more believable than the corona scare hoax!” Jake quipped, poking fun at the rampant speculation surrounding the game’s performance. Juulio’s sarcastic take on the game's graphics had everyone in stitches: “The biggest tit size is like a C cup. Can't figure out how to turn off mouse acceleration.” \n\nIn the midst of the gaming talk, serious moments emerged. Tom opened up about his girlfriend’s health issues, sharing that she had been diagnosed with early onset heart failure. The group quickly surrounded him with support, reminding him that they were there for him through the tough times. Amidst the laughter, there were genuine moments of reflection, especially when Tom discussed how the situation impacted him and his family.\n\nJack Lonneman stole the spotlight with his academic achievements, proudly announcing his GPA rise from a 2.0 to a 3.15. His progress sparked a mix of pride and playful jealousy among the group, with Aaron teasing him about the long journey it took to reach this point. “Imagine getting a 1.0 in university 101,” he joked, summing up the mix of struggle and triumph that defined their college experiences.\n\nAs the week wrapped up, the festive spirit began to fill the chat. Discussions about Christmas plans, gift ideas, and holiday memes took over, with Randy humorously pushing for a “preppy” holiday aesthetic. “How do you know what his name is?” prompted further inside jokes about their mutual friends and shared experiences. \n\nThe week culminated in a blend of laughter, concern, and camaraderie, reminding everyone that even in tough times, their group chat provided a much-needed escape and support system.\n\n### Character Spotlights:\n- **Aaron D**: The group’s emotional anchor, often sharing his sports-related frustrations and looking for support during fantasy football season.\n- **Tom**: The thoughtful member, grappling with personal challenges"
    },
    {
        "week_starting": "2020-12-14",
        "week_ending": "2020-12-20",
        "summary": "# Weekly Recap: December 14 - December 20, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Fantasy Football Drama**: The group was heavily engaged in fantasy football discussions, with several members in playoff contention.\n- **COVID-19 Vaccine Talk**: A lively discussion around the COVID-19 vaccine, its implications, and personal anecdotes on getting vaccinated.\n- **Humorous Comments & Inside Jokes**: The chat was filled with humorous exchanges about life, food, and pop culture, including memes and funny videos.\n- **Personal Milestones**: Bront celebrated a perfect CGPA of 4.0, and Jake shared the experience of getting glasses.\n\n### Main Topics of Discussion:\n1. **Fantasy Football**: Key players were discussed, with several members tracking their playoff performance and anxiously checking scores.\n2. **COVID-19 Vaccine**: Conversations around the vaccine rollout, personal experiences, and humorous takes on the subject.\n3. **Food and Drink**: Members shared food experiences, recipes, and their opinions on restaurants and drinks.\n4. **Movies and TV Shows**: Discussions included recommendations for movies to watch, particularly around the holiday season.\n\n### Emotional States:\n- **Humor and Sarcasm**: The overall mood was light, with frequent jokes and memes shared among the group.\n- **Anxiety about COVID and Health**: Some discussions reflected concern about the pandemic and personal health.\n- **Excitement and Pride**: Bront's academic success and others’ personal updates brought excitement and pride within the group.\n\n### Controversies:\n- **Fantasy Football Disagreements**: Some heated debates arose regarding player selections and strategies for the playoffs.\n- **Vaccine Conversations**: Differing opinions on the efficacy and necessity of the COVID-19 vaccine led to some lively back-and-forths.\n\n### Personal Updates and Life Events:\n- **Bront**: Achieved a 4.0 CGPA in his master's program, celebrating his academic achievements.\n- **Jake**: Shared his experience of getting glasses and discussed his family's holiday plans.\n- **Aaron**: Moved back to Boston and discussed his travel plans and experiences.\n\n### Best Line of the Week:\n“Imagine being in India and not getting the vax til like 2023.” – Bront\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc:\nThis week kicked off with a bang as the group dove headfirst into the thrilling world of fantasy football. Aaron was anxiously checking scores, hoping for just a few more points from his players to secure his playoff spot. Meanwhile, Jake was feeling the heat as he was projected to win by a slim margin. The memes flew fast and furious, with quotes like \"there goes Singletary\" and \"my boy ain't even on the field\" becoming instant classics.\n\nAs the week progressed, the conversation shifted gears to a more serious topic: the COVID-19 vaccine. Members shared their thoughts and experiences, leading to humorous anecdotes about the side effects and the overall efficacy of the jab. Hubert cheekily remarked about the vaccine possibly making him “more autistic,” which sent the chat into a whirlwind of laughter and inside jokes about masks and healthcare.\n\nFood was another hot topic, with members sharing their culinary triumphs and failures. Randy boasted about his shakshuka, while Jack lamented over his experience at LensCrafters and his new glasses. The group had a good chuckle when Jake mentioned how he was going to “run in sleet,” with Jack quipping about his own struggles with OCD and running.\n\nAs the weekend rolled around, Bront brought the good news of his academic achievements, flexing a 4.0 CGPA that left everyone in awe. \"Jesus,\" Jack exclaimed, recognizing the hard work that went into maintaining such stellar grades. The chat was filled with congratulations and playful banter, with everyone eager to celebrate Bront's success.\n\nThen came Saturday, and with it, the group’s annual tradition of watching the holiday classic, “Home Alone.” Jack detailed the family’s plans to watch it together via Zoom, complete with matching pajamas and hot chocolate. The festive spirit was contagious, even through the screen. \n\nThe week wrapped up with discussions about movies, gaming, and, of course, more fantasy football as everyone prepared for the playoffs. Aaron was hoping for a big day from his players, and Bront was just trying to keep up with the flood of messages about who to start.\n\n### Character Spotlights:\n- **Bront**: The academic overachiever of the group, Bront’s journey through his master's program has been a rollercoaster, but his triumph this week has made him the star of the chat.\n- **Aaron**: The ever-anxious fantasy football manager, Aaron's comedic timing and quick wit kept the group entertained throughout the week.\n- **Jake**: The laid-back observer, Jake provided commentary on everything from his new glasses to family dynamics, always ready with a quip or a meme to lighten the mood.\n\n### Humorous Moments:\n- The group had a field day with inside jokes abo"
    },
    {
        "week_starting": "2020-12-21",
        "week_ending": "2020-12-27",
        "summary": "# Weekly Recap: December 21 - December 27, 2020\n\n## Summary Section\n\n### Key Highlights:\n- **Virtual Family Gatherings:** The group shared humorous anecdotes about Jack's family's chaotic Zoom Christmas party.\n- **Holiday Baking:** Dennis showcased his impressive babka baking skills, leading to jokes about the need for more baked goods in the group.\n- **Stimulus Talks:** The chat buzzed with discussions about the new stimulus checks, with various opinions and jokes about the amounts and eligibility.\n- **Personal Milestones:** Jack celebrated an impressive GPA, and Zooks announced landing a new job in NYC.\n- **Christmas Celebrations:** Members shared their holiday plans and experiences, including Dennis's family drama and Jack's Christmas Eve Mass.\n\n### Main Topics of Discussion:\n1. **Stimulus Bill:** The group discussed the recent stimulus payments, with a mix of skepticism and humor about the amount and timing.\n2. **Holiday Plans:** Members shared their Christmas plans and family dynamics, highlighting the humor and chaos of holiday gatherings.\n3. **Baking and Cooking:** Dennis’s babka and various holiday meals were a focus, showcasing the group's culinary skills.\n4. **Personal Achievements:** Celebrations of academic success and job placements created a supportive atmosphere.\n\n### Emotional States:\n- **Humor:** The chat was filled with jokes, particularly about family dynamics during the holidays.\n- **Anxiety:** Some members expressed anxiety over family gatherings and the ongoing pandemic.\n- **Joy:** Celebratory moments for personal achievements and holiday cheer were prevalent.\n\n### Controversies:\n- **Christmas Gatherings:** There were light-hearted disagreements about the safety and necessity of attending family gatherings during the pandemic.\n- **Stimulus Amounts:** Debate over whether the $600 stimulus was adequate sparked some lively banter.\n\n### Personal Updates and Life Events:\n- **Jack** celebrated a GPA of 3.217, feeling accomplished as he nears graduation.\n- **Zooks** announced he landed a new job with Marsh & McLennan in NYC, marking a significant career milestone.\n- **Dennis** dealt with family drama and expressed a desire for a peaceful holiday.\n\n### Best Line of the Week:\n*\"If you think your religious leader gives a f*** about your congregation or his constituents by having them gather together in the middle of a public health emergency, you’re dead wrong.\"* – Bront\n\n---\n\n## Narrative Section\n\n### Week-by-Week Story Arc:\nAs the group rolled into the week of December 21, excitement filled the chat as everyone prepared for the holiday season. Jack kicked off the week with tales from his family’s chaotic Zoom Christmas party. “My dad’s zooming from his desk and won’t stop working,” he lamented, while the group burst into laughter, imagining Jack’s family split across various rooms, all unmuted and utterly chaotic.\n\nDennis, ever the culinary wizard, showcased his impressive baking skills with homemade babka. “I’m thrilled with how it came out. Gotta wait an hour before I can cut it up,” he shared. This led to a flurry of jokes about needing more sweets in their lives, with Jake quipping about his wife needing her first check, as the group continued to dissect the recent stimulus bill.\n\nThe stimulus checks became a hot topic, with Bront leading the charge, stating, “Give me your social security. I want my $600!” The banter about the checks provided the perfect comedic relief amidst the holiday stress, especially when Hubert chimed in about saving for a PS5. \n\nAs the week progressed, personal milestones emerged. Jack proudly announced his GPA of 3.217, celebrating with the group, who cheered him on. “Great gpa! Almost done too!” Hubert encouraged him, reminiscing about their own struggles during freshman year.\n\nOn Christmas Eve, Jack shared his plans about attending Mass, drawing some funny comments about the safety of such gatherings. “If airplanes are running, I think people can go to church if they want to,” he argued, prompting a friendly debate about the risks associated with holiday gatherings during a pandemic. “You’re not going to church, you’re going for a photo op!” Aaron joked.\n\nMeanwhile, Dennis’s family drama unfolded, with him needing to escape the “storm” of his in-laws. “I just want a quiet house tomorrow so I can drink and read,” he sighed, while others offered him refuge.\n\nThe Christmas Day festivities brought everyone together, sharing their meals and holiday experiences in the chat. Hubert prepared impressive sous vide steaks, while others recounted their own holiday culinary adventures. The group’s shared camaraderie shone through, with laughter echoing as they recalled quirky family traditions and inside jokes.\n\nAs the week wound down, the group reflected on their shared experiences of the chaotic yet joyous holiday season. “This Christmas break marks 5 years of the GM,” Bront noted, a reminder of the lasting friendships formed over time. \n\nWith personal achievements celebra"
    },
    {
        "week_starting": "2020-12-28",
        "week_ending": "2021-01-03",
        "summary": "# Weekly Recap: December 28, 2020 - January 3, 2021\n\n## Summary Section\n\n### Key Highlights:\n- **New Year’s Eve Plans:** The group had various plans for New Year's Eve, with discussions about safety and gatherings.\n- **Personal Milestones:** Hubert Cumberdale revealed he had food poisoning, and there were discussions about new jobs and life changes.\n- **Engagement Announcement:** Lawman Of The Town announced his engagement, surprising the group.\n- **Stimulus Check Discussions:** The group shared updates on the status of stimulus checks throughout the week.\n\n### Main Topics of Discussion:\n1. **New Year’s Plans:** Conversations about how to celebrate safely during the pandemic.\n2. **Food and Cooking:** A lot of talk around cooking, holiday meals, and food preferences.\n3. **Personal Updates:** Updates about jobs, relationships, and personal health.\n4. **Inside Jokes:** Frequent references to past memes and shared group experiences.\n\n### Emotional States:\n- **Humor and Light-heartedness:** The mood was predominantly humorous, with plenty of jokes and memes shared.\n- **Anxiety and Frustration:** Some discussions reflected anxiety about COVID-19 and the future, especially concerning work and personal lives.\n\n### Controversies:\n- **Disagreements on COVID Safety:** A heated exchange between Bront and Jack Lonneman about gathering for New Year’s Eve and the implications of asymptomatic spread.\n- **Discussions about Money:** Debates on spending habits and the value of experiences vs. material purchases stirred some light-hearted contention.\n\n### Personal Updates and Life Events:\n- **Engagement:** Lawman Of The Town announced his engagement, which was a highlight of the week.\n- **Food Poisoning:** Hubert Cumberdale shared he suffered from food poisoning, which led to some humorous jabs.\n- **Work Updates:** Various members talked about jobs, with some starting new positions and others facing uncertainties.\n\n### Best Line of the Week:\n“Did you know SUICIDE rates INCREASED this year? Probably because everyone is AT HOME with their MASKS ON hahahha.” - Bront (sarcastically highlighting the struggles of 2020).\n\n---\n\n## Narrative Section\n\nThe week kicked off with the usual banter as the group settled into the post-Christmas haze. Hubert Cumberdale started the chat with a hilarious jab about his food poisoning, claiming it was definitely from the eggnog — talk about a holiday hangover! This led to a barrage of jokes about his \"boomer\" lifestyle choice. Meanwhile, Aaron D was itching to celebrate New Year’s Eve with a drink in hand, even suggesting a party, only to be met with Bront's sarcastic reminder about the pandemic. \n\nAs the week progressed, Lawman Of The Town surprised everyone with news of his engagement. “Congrats, man!” echoed through the chat, as everyone expressed their shock and excitement. The engagement was a perfect segue into discussions about wedding plans, and of course, the obligatory teasing about the “#influencer” world.\n\nNew Year’s plans loomed large over the group, with many discussing how to celebrate safely. Jack Lonneman shared his NYE plans, which were dashed when the host dropped the ball on the gathering. “Superspreader Jack at it again,” quipped Bront, referencing a running joke about Jack’s questionable party choices. Meanwhile, Randy was just trying to survive another workday, wishing for a little more excitement.\n\nAmidst the laughs, there were more serious moments, particularly concerning the state of the world and the ongoing pandemic. Conversations about mental health and the increased suicide rates in 2020 provided a sobering backdrop to the jokes. Bront's dark humor about the situation was both alarming and amusing, encapsulating the group's coping mechanism — laughter.\n\nPersonal updates were a staple of the week, with discussions around jobs and life changes. Aaron D revealed plans for a new camera lens purchase, while Hubert shared the woes of returning to work after a holiday break. The stimulus checks continued to be a hot topic, with everyone eagerly waiting for their deposits to hit.\n\nAs the week closed out, the group was filled with a sense of hope for the new year, despite the uncertainties lingering from the past year. The camaraderie, humor, and support reflected in their conversations showcased a strong bond, reminding everyone that even in tough times, laughter is the best medicine.\n\nAs the clock struck midnight on New Year’s Eve, the group's chat exploded with cheers, virtual toasts, and a collective “Fuck off, 2020!” The inside jokes, shared experiences, and heartfelt moments made for a memorable week, setting the tone for what they hoped would be a better year ahead."
    }
]